apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_UIM.cpp
    pTD = AllocateTD(); 	// ***** What if this fails?????? see also OHCI
    pTD->pShared->flags = 0;	// make sure active is 0
    pTD->pShared->nextTD = HostToUSBLong(kEHCITermFlag);
    pTD->pShared->altTD = HostToUSBLong(kEHCITermFlag);
    pTD->command = NULL;
    
    USBLog(7, "%s[%p]::MakeEmptyEndPoint - pointing NextqTDPtr to %lx", getName(), this, pTD->pPhysical);
    pED->GetSharedLogical()->NextqTDPtr = HostToUSBLong( (UInt32)pTD->pPhysical & ~0x1F);

    pED->qTD = pTD;
    pED->TailTD =  pED->qTD;

    pED->responseToStall = 0;

    return pED;
}



AppleEHCIQueueHead * 
AppleUSBEHCI::MakeEmptyIntEndPoint(
    UInt8 			functionAddress,
    UInt8			endpointNumber,
    UInt16			maxPacketSize,
    UInt8			speed,
    USBDeviceAddress            highSpeedHub,
    int                         highSpeedPort,
    UInt8			direction)
{
    AppleEHCIQueueHead * 	intED;
    UInt32			mySMask;
    
    intED = MakeEmptyEndPoint(functionAddress, endpointNumber, maxPacketSize, speed, highSpeedHub, highSpeedPort, direction);
	
    if (intED == NULL)
	return(NULL);

    mySMask = (0x08 << kEHCIEDSplitFlags_SMaskPhase);		// 3272813 - start on microframe 3
    if(speed != kUSBDeviceSpeedHigh)
    {
	mySMask |= (0xE0 << kEHCIEDSplitFlags_CMaskPhase);	// Complete  on frames 5, 6, and 7
    }

    intED->GetSharedLogical()->splitFlags |= HostToUSBLong(mySMask);
    return intED;
}



void 
AppleUSBEHCI::linkAsyncEndpoint(AppleEHCIQueueHead *CBED, AppleEHCIQueueHead *pEDHead)
{
    IOPhysicalAddress			newHorizPtr;

    if(pEDHead == NULL)	// No previous EDs, make this head of queue.
    {
	CBED->GetSharedLogical()->flags |= HostToUSBLong(1 << kEHCIEDFlags_HPhase);
    }

    // Point first endpoint to itself
    newHorizPtr = HostToUSBLong(CBED->GetPhysicalAddrWithType());		// Its a queue head

    USBLog(7, "%s[%p]::linkAsynEndpoint pEDHead %p", getName(), this, pEDHead);

    if(pEDHead == NULL)
    {
	CBED->GetSharedLogical()->nextQH = newHorizPtr;
	CBED->_logicalNext = NULL;
    }
    else
    {
	// New endpoints are inserted just after queuehead (not at beginning or end).
	
	// Point new endpoint at same endpoint old queuehead was pointing
	CBED->GetSharedLogical()->nextQH =  pEDHead->GetSharedLogical()->nextQH;
	CBED->_logicalNext = pEDHead->_logicalNext;
	
	// Point queue head to new endpoint
	pEDHead->_logicalNext = CBED;
	pEDHead->GetSharedLogical()->nextQH = newHorizPtr;
    }
}



AppleEHCIQueueHead * 
AppleUSBEHCI::AddEmptyCBEndPoint(
    UInt8 			functionAddress,
    UInt8			endpointNumber,
    UInt16			maxPacketSize,
    UInt8			speed,
    USBDeviceAddress            highSpeedHub,
    int                  	highSpeedPort,
    UInt8			direction,
    AppleEHCIQueueHead *	pED)
{
    AppleEHCIQueueHead *	CBED;
    UInt32 			cFlag;
    UInt32			myDataToggleCntrl;

    USBLog(7, "%s[%p]::AddEmptyCBEndPoint speed %d @(%d, %d)", getName(), this, speed, highSpeedHub, highSpeedPort);
   
    CBED = MakeEmptyEndPoint(functionAddress, endpointNumber, maxPacketSize, speed, highSpeedHub, highSpeedPort, direction);

    if (CBED == NULL)
	return(NULL);

    cFlag = 0;
    if(kEHCIEDDirectionTD == direction)
    {
	myDataToggleCntrl = 1 << kEHCIEDFlags_DTCPhase;
	if(speed != kUSBDeviceSpeedHigh)
	{
	    cFlag = 1 << kEHCIEDFlags_CPhase;
	}
    }
    else
    {
	myDataToggleCntrl = 0;
    }

    CBED->GetSharedLogical()->flags |= HostToUSBLong(myDataToggleCntrl | cFlag);
	linkAsyncEndpoint(CBED, pED);
    
    return CBED;
}



IOReturn 
AppleUSBEHCI::UIMCreateControlTransfer(
    short				functionAddress,
    short				endpointNumber,
    IOUSBCompletion			completion,
    void*				CBP,
    bool				bufferRounding,
    UInt32				bufferSize,
    short				direction)
{
    // this is the old 1.8/1.8.1 method. It should not be used any more.
    USBLog(1, "%s(%p)UIMCreateControlTransfer- calling the wrong method!", getName(), this);
    return kIOReturnIPCError;
}



void
AppleUSBEHCI::printAsyncQueue()
{
    AppleEHCIQueueHead *pED = _AsyncHead;
    
    if (pED)
    {
	USBLog(7, "%s[%p]::printAsyncQueue", getName(), this);
	while (pED)
	{
		//pED->print();
	    pED = OSDynamicCast(AppleEHCIQueueHead, pED->_logicalNext);
	}
    }
    else
    {
	USBLog(7, "%s[%p]::printAsyncQueue: NULL Async Queue", getName(), this);
    }
}



void AppleUSBEHCI::printTD(EHCIGeneralTransferDescriptorPtr		pTD)
{
#if 1
	IOLog("print TD turned off\n");
#else
    if(pTD == 0)
    {
        IOLog("Attempt to print null TD\n");
        return;
    }
	USBLog(5, "%s[%p]::printED: ------pTD at %lx", getName(), this, (UInt32)pTD);
	USBLog(5, "%s[%p]::printED: nextTD:  %lx", getName(), this, USBToHostLong(pTD->pShared->nextTD));
	USBLog(5, "%s[%p]::printED: altTD:   %lx", getName(), this, USBToHostLong(pTD->pShared->altTD));
	USBLog(5, "%s[%p]::printED: flags:   %lx", getName(), this, USBToHostLong(pTD->pShared->flags));
	USBLog(5, "%s[%p]::printED: BuffPtr0: %lx", getName(), this, USBToHostLong(pTD->pShared->BuffPtr[0]));
	USBLog(5, "%s[%p]::printED: pEndpt:  %lx",  getName(), this, (UInt32)(pTD->pQH));
//	USBLog(5, "%s[%p]::printED: bufSiz:  %lx", getName(), this, (UInt32)(pTD->bufferSize));
	USBLog(5, "%s[%p]::printED: pPhys:   %lx", getName(), this, (UInt32)(pTD->pPhysical));
	USBLog(5, "%s[%p]::printED: pLogNxt: %lx", getName(), this, (UInt32)(pTD->pLogicalNext));
	USBLog(5, "%s[%p]::printED: logBf:   %lx", getName(), this, (UInt32)(pTD->logicalBuffer));
#endif

}


IOReturn 
AppleUSBEHCI::UIMCreateControlTransfer(
    short				functionAddress,
    short				endpointNumber,
    IOUSBCommand*			command,
    IOMemoryDescriptor*			CBP,
    bool				bufferRounding,
    UInt32				bufferSize,
    short				direction)
{
    AppleEHCIQueueHead *		pEDQueue;
    AppleEHCIQueueHead *		pEDDummy;
    IOReturn				status;
    IOUSBCompletion			completion = command->GetUSLCompletion();

    USBLog(7, "%s[%p]::UIMCreateControlTransfer adr=%d:%d cbp=%lx:%lx br=%s cback=[%p:%p] dir=%d)",
          getName(), this, functionAddress, endpointNumber, (UInt32)CBP, bufferSize,
          bufferRounding ? "YES":"NO", completion.target, completion.parameter, direction);
    
