apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_UIM.cpp
    // search for endpoint descriptor
    pEDQueue = FindControlBulkEndpoint(functionAddress, endpointNumber, &pEDDummy, kEHCIEDDirectionTD);
    USBLog(7, "%s[%p]::UIMCreateControlTransfer -- found endpoint at %p", getName(), this, pEDQueue);

    if (pEDQueue == NULL)
    {
        USBLog(3, "%s[%p]::UIMCreateControlTransfer- Could not find endpoint!", getName(), this);
        return kIOUSBEndpointNotFound;
    }


    status = allocateTDs(pEDQueue, command, CBP, bufferSize, direction, true);

    if(status == kIOReturnSuccess)
    {
	USBLog(7, "%s[%p]::UIMCreateControlTransfer allocateTDS done - CMD = %p, STS = %p", getName(), this, USBToHostLong(_pEHCIRegisters->USBCMD), USBToHostLong(_pEHCIRegisters->USBSTS));
	printAsyncQueue();
	EnableAsyncSchedule();
    }
    else
    {
        USBError(1, "%s[%p]::UIMCreateControlTransfer - allocateTDs returned error %x", getName(), this, (UInt32)status);
    }
    
    return status;
}



AppleEHCIQueueHead * 
AppleUSBEHCI::FindControlBulkEndpoint (
    short 			functionNumber, 
    short			endpointNumber, 
    AppleEHCIQueueHead *   	*pEDBack,
    short 			direction)
{
    UInt32			unique;
    AppleEHCIQueueHead *	pEDQueue;
    AppleEHCIQueueHead *	pEDQueueBack;
    short 			EDDirection;
	
    // search for endpoint descriptor
    unique = (UInt32) ((((UInt32) endpointNumber) << kEHCIEDFlags_ENPhase) | ((UInt32) functionNumber));
    
    
    pEDQueue = _AsyncHead;
    pEDQueueBack = NULL;
    if(pEDQueue == NULL)
    {
	USBLog(7, "%s[%p]::FindControlBulkEndpoint - pEDQueue is NULL", getName(), this);
	return NULL;
    }
    
    do {
	EDDirection = pEDQueue->direction;
	if( ( (USBToHostLong(pEDQueue->GetSharedLogical()->flags) & kUniqueNumNoDirMask) == unique) && ( ((EDDirection == kEHCIEDDirectionTD) || (EDDirection) == direction)) ) 
	{
	    if (pEDBack)
		*pEDBack = pEDQueueBack;
	    return pEDQueue;
	} else 
	{
	    pEDQueueBack = pEDQueue;
	    pEDQueue = OSDynamicCast(AppleEHCIQueueHead, pEDQueue->_logicalNext);
	}
    } while (pEDQueue != NULL);
    return NULL;
}



IOReturn 
AppleUSBEHCI::allocateTDs(
    AppleEHCIQueueHead *		pEDQueue,
    IOUSBCommand 			*command,
    IOMemoryDescriptor 			*CBP,
    UInt32				bufferSize,
    UInt16				direction,
    Boolean				controlTransaction)
{

    EHCIGeneralTransferDescriptorPtr	pTD1, pTD, pTDnew, pTDLast;
    UInt32				myToggle = 0;
    UInt32				myDirection = 0;
    IOByteCount				transferOffset;
    UInt32				pageCount;
    UInt32				flags;
    IOReturn				status = kIOReturnSuccess;
    UInt32				maxPacket;
    UInt32  				bytesThisTD, segment;
    UInt32				curTDsegment;
    UInt32				totalPhysLength;
    IOPhysicalAddress			dmaStartAddr;
    UInt32				dmaStartOffset;
    UInt32				bytesToSchedule;
    bool				needNewTD = false;
    UInt32				maxTDLength;

/* *********** Note: Always put the flags in the TD last. ************** */
/* *********** This is what kicks off the transaction if  ************** */
/* *********** the next and alt pointers are not set up   ************** */
/* *********** then the controller will pick up and cache ************** */
/* *********** crap for the TD.                           ************** */

    if(controlTransaction)
    {
	myToggle = 0;	// Use data0 for setup 
	if(direction != kEHCIEDDirectionTD)
	{	// Setup uses Data 0, data & status use Data1 
            myToggle |= kEHCITDFlags_DT;	// use Data1 
	}
    }

    myDirection = (UInt32) direction << kEHCITDFlags_PIDPhase;
    maxPacket   =  (USBToHostLong(pEDQueue->GetSharedLogical()->flags)  & kEHCIEDFlags_MPS) >> kEHCIEDFlags_MPSPhase;

    // Slight change of plan.
    // I was filling in the tail, then pointing that to a new TD which then
    // became the tail. Repeat until entire buffer is covered.
    // The problem with that is AltNextqTDptr. I was leaving this as invalid
    // in the theory that a short packet would halt the queue and it would 
    // then get kicked back into life by scavengeAnEnpoint. It was abit  tricky
    // to make it point to the new tail TD when you don't know where that's
    // going to be in a multi TD situation.
    
    // New plan. Allocate all the TDs in a chain unlinked to the endpoint
    // then link them in by copying the data from the first new TD to the
    // tail TD, then making the first new TD the tail TD. All along
    // AltNextqTDs will be pointed to this first new TD (qTD1), 
    // Its easy to point to something when you know where it is.
    
    // First allocate the first of the new bunch
    pTD1 = AllocateTD();

    if (pTD1 == NULL)
    {
	USBError(1, "%s[%p]::allocateTDs can't allocate 1st new TD", getName(), this);
	return kIOReturnNoMemory;
    }
    pTD = pTD1;	// We'll be working with pTD

    if (bufferSize != 0)
    {	    
        transferOffset = 0;
	curTDsegment = 0;
	bytesThisTD = 0;
        while (transferOffset < bufferSize)
        {
	    // first, calculate the maximum possible transfer of the given segment. note that this was already checked for
	    // being disjoint, so we don't have to worry about that.
	    dmaStartAddr = CBP->getPhysicalSegment(transferOffset, &totalPhysLength);
	    USBLog(7, "%s[%p]::allocateTDs - getPhysicalSegment returned length of %d (out of %d) and start of %p", getName(), this, totalPhysLength, bufferSize, dmaStartAddr);
	    dmaStartOffset = (dmaStartAddr & (kEHCIPageSize-1));
	    bytesToSchedule = 0;
	    
	    // only the first segment can start on a non page boundary
	    if ((curTDsegment == 0) || (dmaStartOffset == 0))
	    {
                needNewTD = false;
                
		if (totalPhysLength > bufferSize)
		{
		    USBLog(1, "%s[%p]::allocateTDs - segment physical length > buffer size - very strange", getName(), this);
		    totalPhysLength = bufferSize;
		}
		// each TD can transfer at most four full pages plus from the initial offset to the end of the first page
		maxTDLength = ((kEHCIPagesPerTD-curTDsegment) * kEHCIPageSize) - dmaStartOffset;
		if (totalPhysLength > maxTDLength)
		{
		    if ((curTDsegment == 0) && (dmaStartOffset != 0))
		    {
			// truncate this TD to exactly 4 pages, which will always be a multiple of MPS
			USBLog(7, "%s[%p]::allocateTDs - segment won't fit - using 4 pages for this TD", getName(), this);
			bytesToSchedule = (kEHCIPagesPerTD-1) * kEHCIPageSize;
		    }
		    else
		    {
			// truncate this TD to however many pages are left, which will always be a multiple of MPS
			USBLog(7, "%s[%p]::allocateTDs - segment is larger than 1 TD - using %d pages for this TD", getName(), this, kEHCIPagesPerTD - curTDsegment);
			bytesToSchedule = (kEHCIPagesPerTD - curTDsegment) * kEHCIPageSize;
		    }
		}
		else
		    bytesToSchedule = totalPhysLength;
		    
		bytesThisTD += bytesToSchedule;
		transferOffset += bytesToSchedule;

                // If our transfer for this TD does not end on a page boundary, we need to close the TD
                //
                if ( (transferOffset < bufferSize) && ((dmaStartOffset+bytesToSchedule) & kEHCIPageOffsetMask) )
                {
                    USBLog(6, "%s[%p]::allocateTDs - non-last transfer didn't end at end of page (%d, %d)", getName(), this, dmaStartOffset+bytesToSchedule);
                    needNewTD = true;
                }

                // now schedule all of the bytes I just discovered
		while (bytesToSchedule)
		{
		    pTD->pShared->BuffPtr[curTDsegment++] = HostToUSBLong(dmaStartAddr);
		    dmaStartAddr += (kEHCIPageSize - dmaStartOffset);
		    if (bytesToSchedule > (kEHCIPageSize - dmaStartOffset))
			bytesToSchedule -= (kEHCIPageSize - dmaStartOffset);
		    else
			bytesToSchedule = 0;
		    dmaStartOffset = 0;
		}

                if ( ((curTDsegment < kEHCIPagesPerTD) && (transferOffset < bufferSize)) && !needNewTD )
		{
		    USBLog(7, "%s[%p]::allocateTDs - didn't fill up this TD (segment %d) - going back for more", getName(), this, curTDsegment);
		    continue;
		}
	    }
	    
            flags = kEHCITDioc;				// Want to interrupt on completion
	    
	    USBLog(7, "%s[%p]::allocateTDs - i have %d bytes in %d segments", getName(), this, bytesThisTD, curTDsegment);
	    for (segment = 0; segment < curTDsegment; segment++)
	    {
		USBLog(7, "%s[%p]::allocateTDs - addr[%d]:%p", getName(), this, segment, USBToHostLong(pTD->pShared->BuffPtr[segment]));
	    }

            flags |= (bytesThisTD << kEHCITDFlags_BytesPhase);
            pTD->pShared->altTD = HostToUSBLong(pTD1->pPhysical);	// point alt to first TD, will be fixed up later
	    pTD->pType = (UInt32) kEHCIBulkTransferOutType;
	    flags |= myDirection | myToggle | kEHCITDStatus_Active | (3<<kEHCITDFlags_CerrPhase);
           
	    // this is for debugging
            // pTD->traceFlag = trace;
            pTD->traceFlag = false;
            pTD->pQH = pEDQueue;
          
           
            // only supply a callback when the entire buffer has been
            // transfered.
	    
	    USBLog(6, "%s[%p]::allocateTDs - putting command into TD (%p) on ED (%p)", getName(), this, pTD, pEDQueue);
	    pTD->command = command;				// Do like OHCI, link to command from each TD
            if (transferOffset >= bufferSize)
            {
		myToggle = 0;					// Only set toggle on first TD
		pTD->lastTDofTransaction = true;
		pTD->logicalBuffer = CBP;
		pTD->pShared->flags = HostToUSBLong(flags);
		//if(trace)printTD(pTD);
            }
	    else
            {
		pTD->lastTDofTransaction = false;
		myToggle = 0;	// Only set toggle on first TD
		pTDnew = AllocateTD();
		if (pTDnew == NULL)
		{
		    status = kIOReturnNoMemory;
		    USBError(1, "%s[%p]::allocateTDs can't allocate new TD", getName(), this);
		}
		else
		{
		    pTD->pShared->nextTD = HostToUSBLong(pTDnew->pPhysical);
		    pTD->pLogicalNext = pTDnew;
		    pTD->pShared->flags = HostToUSBLong(flags);		// Doesn't matter about flags, not linked in yet
		    // if(trace)printTD(pTD);
		    pTD = pTDnew;
		    curTDsegment = 0;
		    bytesThisTD = 0;
		    USBLog(7, "%s[%p]::allocateTDs - got another TD - going to fill it up too (%d, %d)", getName(), this, transferOffset, bufferSize);
		}
            }
        }
    }
    else
    {
	// no buffer to transfer
	pTD->pShared->altTD = HostToUSBLong(pTD1->pPhysical);	// point alt to first TD, will be fixed up later
	USBLog(6, "%s[%p]::allocateTDs - (no buffer)- putting command into TD (%p) on ED (%p)", getName(), this, pTD, pEDQueue);
	pTD->command = command;
	pTD->lastTDofTransaction = true;
	pTD->logicalBuffer = CBP;
	// pTD->traceFlag = trace;
	pTD->traceFlag = false;
	pTD->pQH = pEDQueue;
	flags = kEHCITDioc | kEHCITDioc | myDirection | myToggle | kEHCITDStatus_Active | (3<<kEHCITDFlags_CerrPhase);
	// if(trace)printTD(pTD);
	pTD->pShared->flags = HostToUSBLong(flags);
    }

    pTDLast = pEDQueue->TailTD;
    pTD->pShared->nextTD = HostToUSBLong(pTD1->pPhysical);
    pTD->pLogicalNext = pTD1;

    
    // We now have a new chain of TDs. link it in.
    // pTD1, pointer to first TD
    // pTD, pointer to last TD
    // pTDLast is last currently on endpoint, will be made first

