apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_UIM.cpp
    flags = pTD1->pShared->flags;
    pTD1->pShared->flags = 0;

    // Copy contents of first TD to old tail
    pTDLast->pShared->nextTD = pTD1->pShared->nextTD;
    pTDLast->pShared->altTD = pTD1->pShared->altTD;
    pTDLast->pShared->flags = 0;
    pTDLast->pShared->BuffPtr[0] = pTD1->pShared->BuffPtr[0];
    pTDLast->pShared->BuffPtr[1] = pTD1->pShared->BuffPtr[1];
    pTDLast->pShared->BuffPtr[2] = pTD1->pShared->BuffPtr[2];
    pTDLast->pShared->BuffPtr[3] = pTD1->pShared->BuffPtr[3];
    pTDLast->pShared->BuffPtr[4] = pTD1->pShared->BuffPtr[4];
    pTDLast->pQH = pTD1->pQH;
    USBLog(7, "%s[%p]::allocateTDs - transfering command from TD (%p) to TD (%p)", getName(), this, pTD1, pTDLast);
    pTDLast->command = pTD1->command;
    pTDLast->lastTDofTransaction = pTD1->lastTDofTransaction;
    //pTDLast->bufferSize = pTD1->bufferSize;
    pTDLast->traceFlag = pTD1->traceFlag;
    pTDLast->pType = pTD1->pType;
    pTDLast->pLogicalNext = pTD1->pLogicalNext;
    pTDLast->logicalBuffer = pTD1->logicalBuffer;
    
    // Note not copying
    
    //  flags
    //  unused
    //  index      (pertains to TD)
    //  pPhysical  (pretains to TD)

    // Point end of new TDs to first TD, now new tail
    pTD->pShared->nextTD = HostToUSBLong(pTD1->pPhysical);
    pTD->pLogicalNext = pTD1;
    
    // squash pointers on new tail
    pTD1->pShared->nextTD = HostToUSBLong(kEHCITermFlag);
    pTD1->pShared->altTD = HostToUSBLong(kEHCITermFlag);
    pTD1->pLogicalNext = 0;
    USBLog(7, "%s[%p]::allocateTDs - zeroing out command in  TD (%p)", getName(), this, pTD1);
    pTD1->command = NULL;
    
    // This is (of course) copied from the 9 UIM. It has this cryptic note.
    // **** THIS NEEDS TO BE CHANGED, SEE NOTE
    // we have good status, so let's kick off the machine
    // Make new descriptor the tail
    pEDQueue->TailTD = pTD1;
    pTDLast->pShared->flags = flags;

    if (status)
    {
	USBLog(3, "%s[%p] CreateGeneralTransfer: returning status 0x%x", getName(), this, status);
    }
    return status;
}



static UInt32
mungeECHIStatus(UInt32 flags, EHCIGeneralTransferDescriptorPtr pHCDoneTD)
{
    AppleEHCIQueueHead * pEndpoint;

#if 0

/* Mail from John Howard */

Active CErr Halted XactErr Bytes2Xfer     
-- These will be no error, halted not set

  0     >0    0      0        0      normal (nc)
  0     >0    0      0        >0     short packet (sp)
  0     >0    0      1        >=0    (nc or sp) with 
                                       one or more retries for
                                       XactErrors detected

-- These will be stalled, CErr still has some left
                                   
  0     >0    1      0        >0     assuming no other status bits
                                       are set, this was a STALL
                                       response. Bytes2Xfer is a 
                                       don''t care.
  0     >0    1      1        >0     STALL response (same assumption)
                                       during some bus transaction
                                       during the buffer a timeout,
                                       etc. was encountered

-- Finally we have misc transaction error.

  0     0     1      1        >=0    three consecutive bus transaction
                                       errors (any of bad pid, timeout, 
                                       data crc, etc.)
                                       
Also:
  If a transaction transaltor gets an error on an Int or Isoc
  it returns an Err handshake. Then you find:
  
Ping State/Err == 1
  
  
  If a TT gets 3 errors on a control or bulk transaction you get
  a STALL from the TT. Ugh! how do you cope with that.
  

#endif


    pEndpoint = pHCDoneTD->pQH;

    if((flags & kEHCITDStatus_Halted) == 0)
    {
	// transaction completed sucessfully
	// Clear error state flag
	pEndpoint->responseToStall = 0;
	return	kIOReturnSuccess;
    }

    if( (flags & kEHCITDStatus_BuffErr) != 0)
    {	
	// Buffer over or under run error - i.e. the controller could not keep up from or to system memory
	if( (flags & kEHCITDFlags_PID) == (1 << kEHCITDFlags_PIDPhase) )	
	{	
	    // An in token
	    return kOHCIITDConditionBufferOverrun;
	}
	else
	{	
	    // OUT/Status, data going out 
	    return kOHCIITDConditionBufferUnderrun;
	}
    }
    
    if ( (flags & kEHCITDStatus_Babble) != 0)
    {
	// Babble means that we had a data overrun
	// Buffer over or under run error
	if( (flags & kEHCITDFlags_PID) == (1 << kEHCITDFlags_PIDPhase) )	
	{	
	    // An in token
	    return kOHCIITDConditionDataOverrun;
	}
	// for out token, we let the other error processing handle it, since the data over/underrun conditions are IN only
    }

    if( (flags & kEHCITDFlags_Cerr) != 0)
    {	
	// A STALL
	// Check endpoint to see if we need to send a not responding instead
	if(  ((USBToHostLong(pEndpoint->GetSharedLogical()->flags) & kEHCIEDFlags_S) >> kEHCIEDFlags_SPhase) != 2)
	{
	    // A full/low speed transaction, must be behind a transaction translator
	    if( (USBToHostLong(pEndpoint->GetSharedLogical()->splitFlags) & kEHCIEDSplitFlags_SMask) == 0)
	    {
		// Not an Int transaction
		// Commute first and every other STALL to a not responding, you can't tell the differernce
		// according to the 2.0 spec where it goes completely off the rails.
		// See section 11.17.1 and appendicies A-14 and A-23
		
		pEndpoint->responseToStall = 1 - pEndpoint->responseToStall;	// Switch 0 - 1
		if(pEndpoint->responseToStall == 1)
		{
		    return kOHCIITDConditionStall;
		}
		else
		{
		    return kOHCIITDConditionDeviceNotResponding;
		}
	    }
	}
	return kOHCIITDConditionStall;
    }	

    if( (flags & kEHCITDStatus_XactErr) != 0)
    {

	if(  ((USBToHostLong(pEndpoint->GetSharedLogical()->flags) & kEHCIEDFlags_S) >> kEHCIEDFlags_SPhase) != 2)
       {       // A split transaction
           return(kIOUSBHighSpeedSplitError);
       }

	return kOHCIITDConditionDeviceNotResponding;	// Can't tell this from any other transaction err
    }	
    
