apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_UIM.cpp
}

IOReturn
AppleUSBEHCI::scavengeAnIsocTD(AppleEHCIIsochListElement *pTD, IOUSBCompletionAction safeAction)
{
    AppleEHCIIsochEndpointPtr 		pEP;
    IOReturn				ret;
    AbsoluteTime			timeStamp;

    pEP = pTD->myEndpoint;
    clock_get_uptime(&timeStamp);
    if(pEP == NULL)
    {
	USBError(1, "%s[%p]::scavengeAnIsocEndPoint - could not find endpoint associated with iTD (%p)", getName(), this, pTD->myEndpoint);
    }
    else
    {	
	if (!pTD->lowLatency)
			ret = pTD->UpdateFrameList(timeStamp);		// TODO - accumulate the return values
	PutTDonDoneQueue(pEP, pTD, true);
    }
    
    if(pTD->completion.action != NULL)
    {
	ReturnIsocDoneQueue(pEP);
    }
	
    return(kIOReturnSuccess);
}



void
AppleUSBEHCI::PutTDonToDoList(AppleEHCIIsochEndpointPtr pED, AppleEHCIIsochListElement *pTD)
{
    USBLog(7, "%s[%p]::PutTDonToDoList - pED (%p) pTD (%p) frameNumber(%Lx)", getName(), this, pED, pTD, pTD->frameNumber);
    // Link TD into todo list
    if(pED->toDoList == NULL)
    {
	// as the head of a new list
	pED->toDoList = pTD;
    }
    else
    {
	// at the tail of the old list
	pED->toDoEnd->_logicalNext = pTD;
    }
    // no matter what we are the new tail
    pED->toDoEnd = pTD;
    pED->activeTDs++;
}



AppleEHCIIsochListElement *
AppleUSBEHCI::GetTDfromToDoList(AppleEHCIIsochEndpointPtr pED)
{
    AppleEHCIIsochListElement	*pTD;
    
    pTD = pED->toDoList;
    if (pTD)
    {
	if (pTD == pED->toDoEnd)
	    pED->toDoList = pED->toDoEnd = NULL;
	else
	    pED->toDoList = OSDynamicCast(AppleEHCIIsochListElement, pTD->_logicalNext);
    }
    return pTD;
}



void
AppleUSBEHCI::PutTDonDoneQueue(AppleEHCIIsochEndpointPtr pED, AppleEHCIIsochListElement *pTD, bool checkDeferred)
{
    AppleEHCIIsochListElement	*deferredTD;

    if (checkDeferred)
    {
	while (pED->deferredQueue && (pED->deferredQueue->frameNumber < pTD->frameNumber))
	{
	    deferredTD = GetTDfromDeferredQueue(pED);
	    PutTDonDoneQueue(pED, deferredTD, false);
	}
    }
    
    if(pED->doneQueue == NULL)
    {
	// as the head of a new list
	pED->doneQueue = pTD;
    }
    else
    {
	// at the tail of the old list
	pED->doneEnd->_logicalNext = pTD;
    }
    // and not matter what we are now the new tail
    pED->doneEnd = pTD;
	
}



AppleEHCIIsochListElement *
AppleUSBEHCI::GetTDfromDoneQueue(AppleEHCIIsochEndpointPtr pED)
{
    AppleEHCIIsochListElement	*pTD;
    
    pTD = pED->doneQueue;
    if (pTD)
    {
	if (pTD == pED->doneEnd)
	    pED->doneQueue = pED->doneEnd = NULL;
	else
	    pED->doneQueue = OSDynamicCast(AppleEHCIIsochListElement, pTD->_logicalNext);
	pED->activeTDs--;
    }
    return pTD;
}



void
AppleUSBEHCI::PutTDonDeferredQueue(AppleEHCIIsochEndpointPtr pED, AppleEHCIIsochListElement *pTD)
{
    if(pED->deferredQueue == NULL)
    {
	// as the head of a new list
	pED->deferredQueue = pTD;
    }
    else
    {
	// at the tail of the old list
	pED->deferredEnd->_logicalNext = pTD;
    }
    // and not matter what we are now the new tail
    pED->deferredEnd = pTD;
	
}



AppleEHCIIsochListElement *
AppleUSBEHCI::GetTDfromDeferredQueue(AppleEHCIIsochEndpointPtr pED)
{
    AppleEHCIIsochListElement	*pTD;
    
    pTD = pED->deferredQueue;
    if (pTD)
    {
	if (pTD == pED->deferredEnd)
	    pED->deferredQueue = pED->deferredEnd = NULL;
	else
	    pED->deferredQueue = OSDynamicCast(AppleEHCIIsochListElement, pTD->_logicalNext);
    }
    return pTD;
}



IOReturn
AppleUSBEHCI::scavengeAnEndpointQueue(AppleEHCIListElement *pListElem, IOUSBCompletionAction safeAction)
{
    EHCIGeneralTransferDescriptorPtr	doneQueue = NULL, doneTail= NULL, qHead, qTD, qEnd;
    UInt32 				flags, count = 0;
    Boolean 				TDisHalted, shortTransfer;
    AppleEHCIQueueHead			*pQH;
    
    while( (pListElem != NULL) && (count++ < 150000) )
    {
	pQH = OSDynamicCast(AppleEHCIQueueHead, pListElem);
	if(pQH)
	{
	    qTD = qHead = pQH->qTD;
	    qEnd = pQH->TailTD;
	    TDisHalted = false;
	    shortTransfer = false;
	    while( (qTD != qEnd)  && (count++ < 150000) )
	    {	
		// This end point has transactions
		flags = USBToHostLong(qTD->pShared->flags);
		if(!TDisHalted && !shortTransfer)
		{
		    if((flags & kEHCITDStatus_Active) != 0)
		    {	// Command is still alive, go to next queue
			break;
		    }
		    // check for halted
		    TDisHalted = ((flags & kEHCITDStatus_Halted) != 0) ;
		    if (!TDisHalted)
		    {
			// this TD is not active, and was not halted, so check to see if it was short
			// if so - we can ignore that state of the remaining TDs until the lastTD
			// since the harwdare skipped them
			shortTransfer = ((flags & kEHCITDFlags_Bytes) >> kEHCITDFlags_BytesPhase) ? true : false;
		    }
		}
		if(qTD->lastTDofTransaction)
		{
		    // We have the complete command
	
		    USBLog(7, "%s[%p]::scavengeAnEndpointQueue - TD (%p) on ED (%p)", getName(), this, qTD, pQH); 
		    if(doneQueue == NULL)
		    {
			doneQueue = qHead;
		    }
		    else
		    {
			doneTail->pLogicalNext = qHead;
		    }
		    doneTail = qTD;
		    qTD = qTD->pLogicalNext;
		    qHead = qTD;
		    doneTail->pLogicalNext = NULL;
		    pQH->qTD = qTD;
		    
		    if(TDisHalted)
		    {
			flags = USBToHostLong(qTD->pShared->flags);
			pQH->GetSharedLogical()->NextqTDPtr = HostToUSBLong( qTD->pPhysical);
			if((flags & kEHCITDStatus_Active) != 0)	// Next command is still active
			{
			    break;
			}
		    }

                    // Reset our loop variables
                    //
                    TDisHalted = false;
                    shortTransfer = false;
                } 
		else
		{
		    USBLog(7, "%s[%p]::scavengeAnEndpointQueue - looking past TD (%p) on ED (%p)", getName(), this, qTD, pQH); 
		    qTD = qTD->pLogicalNext;
		}
	    }
	}
	pListElem = pListElem->_logicalNext;
    }
    if(doneQueue != NULL)
    {
	EHCIUIMDoDoneQueueProcessing(doneQueue, kIOReturnSuccess, safeAction, NULL);
    }
    if(count > 1000)
    {
	USBLog(1, "%s[%p]::scavengeAnEndpointQueue looks like bad ed queue %lx", getName(), this, count);
    }
    
