apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_UIM.cpp
    return status;

}


IOReturn 
AppleUSBEHCI::UIMCreateBulkTransfer(
    short				functionAddress,
    short				endpointNumber,
    IOUSBCompletion			completion,
    IOMemoryDescriptor *		CBP,
    bool				bufferRounding,
    UInt32				bufferSize,
    short				direction)
{
    // this is the old 1.8/1.8.1 method. It should not be used any more.
    USBLog(1, "%s(%p)UIMCreateBulkTransfer- calling the wrong method!", getName(), this);
    return kIOReturnIPCError;
}



UInt16
AppleUSBEHCI::validatePollingRate(short rawPollingRate,  short speed, int *offset, UInt16 *bytesAvailable)
{
    UInt16 	pollingRate;
    int 	i;
    UInt16	availableBandwidth[kEHCIMaxPoll];

    pollingRate = rawPollingRate;

    if(speed == kUSBDeviceSpeedHigh)
    {
	USBLog(5,"%s[%p]::validatePollingRate HS pollingRate raw: %d", getName(), this, pollingRate);
	if(pollingRate <= 3)
	{
	    // this would be a sub frame polling rate (per microframe) and we will only do frame resolution for now
	    pollingRate = 1;
	}
	else
	{
	    if(pollingRate > 16)
	    {
		int	count = 0;
		// this is an illegal polling rate. however, some HS devices have it
		// so we will treat this like an OLD polling rate, i.e. a # of ms to poll at
		// we need to find the lowest power of 2 to accomodate this, just like FS
		USBLog(1,"%s[%p]::validatePollingRate: illegal HS polling rate (%d), cooking like FS", getName(), this, pollingRate);
		while( (pollingRate >> count) != 1)
		    count++;
	
		pollingRate = (1 <<  count);
		USBLog(1,"%s[%p]::validatePollingRate: (illegal)new cooked polling rate (%d)", getName(), this, pollingRate);
	    }
	    else
	    {
		// the polling rate is in microframes and is the exponent in 2^(rate-1)
		pollingRate = 1 << (pollingRate - 4);
	    }
	}
	if(pollingRate > kEHCIMaxPoll)
	{
	    pollingRate = kEHCIMaxPoll;
	}
	USBLog(5,"%s[%p]::validatePollingRate HS pollingRate cooked: %d", getName(), this, pollingRate);
    }
    else
    {
	// full/low speed device
	int	count = 0;
	// pollingRate is good
	USBLog(5,"%s[%p]::validatePollingRate LS/FS pollingRate raw: %d", getName(), this, pollingRate);

	// Find the next lowest power of 2 for the polling rate
	while( (pollingRate >> count) != 1)
	    count++;

	pollingRate = (1 <<  count);

        // The following is a fix for rdar://3645770.  OHCI controllers had a limit on the polling rate that they poll at -- 32ms. Anything above that
        // would get clamped to 32 ms.  The USB spec indicates that the controller should poll at the polling rate OR lower, so, for FS/LS devices 
        // that are attached to a HS Hub, we are going to clamp the polling rate to 32ms so that those devices behave the same as when attached to
        // an OHCI controller.  The following line used to be:  if(pollingRate > 255) and then set the rate to 128.
        // 
	if(pollingRate > 32)
	{
	    USBLog(5,"%s[%p]::validatePollingRate -  Oops LS/FS pollingRate too high: %d, setting to 128", getName(), this, pollingRate);
	    pollingRate = 32;
	}
	else if( (pollingRate < 8) && (speed == kUSBDeviceSpeedLow) )
	{
	    USBLog(5,"%s[%p]::validatePollingRate Oops LS pollingRate too low: %d, setting to 8.", getName(), this, pollingRate);
	    pollingRate = 8;
	}
	else if(pollingRate == 0)
	{
	    USBLog(5,"%s[%p]::validatePollingRate Oops HS pollingRate too low: %d, setting to 1.", getName(), this, pollingRate);
	    pollingRate = 1;
	}
	USBLog(5, "%s[%p]::validatePollingRate LS/FS pollingRate cooked: %d", getName(), this, pollingRate);
    }
    
    // now that we have the "cooked" polling rate, we need to "balance" the load
    // among the [kEHCIMaxPoll % pollingrate] nodes which might contain this endpoint
    
    for (i=0; i < pollingRate; i++)
	availableBandwidth[i] = kEHCIMaxPeriodicBandwidth;
	
    for (i=0; i < kEHCIMaxPoll; i++)
	if (availableBandwidth[i % pollingRate] > _periodicBandwidth[i])
	    availableBandwidth[i % pollingRate] = _periodicBandwidth[i];
	
    *offset = 0;		// start at 0
    *bytesAvailable = 0;
    
    for (i=0; i < pollingRate; i++)
	if (availableBandwidth[i] > *bytesAvailable)
	{
	    *offset = i;
	    *bytesAvailable = availableBandwidth[i];
	}

    return pollingRate;
}


static AppleEHCIListElement* 
FindIntEDqueue(AppleEHCIListElement *start, UInt8 pollingRate)
{
    AppleEHCIQueueHead 		*pQH;
    AppleEHCIIsochListElement	*pIsoch = OSDynamicCast(AppleEHCIIsochListElement, start);
    
    if (pIsoch)
    {
	// the list starts with some Isoch elements and we need to find the end of them
	while (OSDynamicCast(AppleEHCIIsochListElement, start->_logicalNext))
	{
	    pIsoch = OSDynamicCast(AppleEHCIIsochListElement, start->_logicalNext);
	    start = start->_logicalNext;
	}
	// now pIsoch and start both point to the final Isoch element in the list
	start = start->_logicalNext;
    }
    
    // so either we went through the above loop or pIsoch is NULL. if start is also NULL, then we are 
    // at a list which consists of 0 or more Isoch elements
    if (!start)
	return pIsoch;

    pQH = OSDynamicCast(AppleEHCIQueueHead, start);
    
    pollingRate--;
    if(pQH && (pQH->pollM1 < pollingRate))
    {
	return pIsoch;
    }
	    
    while(start->_logicalNext != NULL)
    {
	pQH = OSDynamicCast(AppleEHCIQueueHead, pQH->_logicalNext);
	if(pQH && (pQH->pollM1 < pollingRate))
	{
	    break;
	}
	start = start->_logicalNext;
    }

    return start;
}



void  
AppleUSBEHCI::linkInterruptEndpoint(AppleEHCIQueueHead *pEHCIEndpointDescriptor)
{
short pollingRate;
UInt16 maxPacketSize;
int offset;
AppleEHCIListElement *	pLE;
UInt32 newHorizPtr;

    maxPacketSize = pEHCIEndpointDescriptor->maxPacketSize;
    offset = pEHCIEndpointDescriptor->offset;
    pollingRate = pEHCIEndpointDescriptor->pollM1+1;

    newHorizPtr = HostToUSBLong( pEHCIEndpointDescriptor->GetPhysicalAddrWithType());
    while( offset < kEHCIPeriodicListEntries)
    {
	pLE = FindIntEDqueue(_logicalPeriodicList[offset], pollingRate);
	if(pLE == NULL)
	{	// Insert as first in queue
	    if(pEHCIEndpointDescriptor->_logicalNext == NULL)
	    {
		pEHCIEndpointDescriptor->_logicalNext = _logicalPeriodicList[offset];
		pEHCIEndpointDescriptor->GetSharedLogical()->nextQH = _periodicList[offset];
	    }
	    else
	    {
		USBError(1, "%s[%p]::linkInterruptEndpoint(%p) - _logicalNext is not NULL! (%p)", getName(), this, pEHCIEndpointDescriptor, pEHCIEndpointDescriptor->_logicalNext);
	    }
	    
