apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_UIM.cpp
	    _logicalPeriodicList[offset] = pEHCIEndpointDescriptor;
	    _periodicList[offset] = newHorizPtr;
	    USBLog(7, "%s[%p]::linkInterruptEndpoint - inserted at top of list %d - next logical (%p) next physical (%p)", getName(), this, offset, pEHCIEndpointDescriptor->_logicalNext, USBToHostLong(pEHCIEndpointDescriptor->GetSharedLogical()->nextQH));
	}
	else if (pEHCIEndpointDescriptor != pLE)
	{	// Insert in middle/end of queue
		
	    if(pEHCIEndpointDescriptor->_logicalNext == NULL)		// JRH - again - how could this not be NULL?
	    {
		pEHCIEndpointDescriptor->_logicalNext = pLE->_logicalNext;
		pEHCIEndpointDescriptor->GetSharedLogical()->nextQH =  pLE->GetPhysicalLink();
	    }
	    else
	    {
		USBError(1, "%s[%p]::linkInterruptEndpoint(%p) - _logicalNext is not NULL! (%p)", getName(), this, pEHCIEndpointDescriptor, pEHCIEndpointDescriptor->_logicalNext);
	    }
	    // Point queue element to new endpoint
	    pLE->_logicalNext = pEHCIEndpointDescriptor;
	    pLE->SetPhysicalLink(newHorizPtr);
	    USBLog(7, "%s[%p]::linkInterruptEndpoint - inserted into list %d - next logical (%p) next physical (%p)", getName(), this, offset, pEHCIEndpointDescriptor->_logicalNext, USBToHostLong(pEHCIEndpointDescriptor->GetSharedLogical()->nextQH));
	}
	else
	{
	    // Else was already linked
	    USBLog(7, "%s[%p]::linkInterruptEndpoint - (%p) already linked into %d (%p)", getName(), this, pEHCIEndpointDescriptor, offset, pLE);
	}
	
	// this gets repeated, but we only subtract up to MaxPoll
	if (offset < kEHCIMaxPoll)
	    _periodicBandwidth[offset] -= maxPacketSize;
	offset += pollingRate;
    } 
    _periodicEDsInSchedule++;
}

IOReturn 
AppleUSBEHCI::UIMCreateInterruptEndpoint(
    short		functionAddress,
    short		endpointNumber,
    UInt8		direction,
    short		speed,
    UInt16		maxPacketSize,
    short		pollingRate)
{
    USBError(1, "%s[%p]::UIMCreateInterruptEndpoint - old version called with no split params");
    return kIOReturnInternalError;
}


IOReturn 
AppleUSBEHCI::UIMCreateInterruptEndpoint(
    short			functionAddress,
    short			endpointNumber,
    UInt8			direction,
    short			speed,
    UInt16			maxPacketSize,
    short			pollingRate,
    USBDeviceAddress    	highSpeedHub,
    int                 	highSpeedPort)
{
    int 			offset;
    UInt16			availableBandwidth;
//    UInt32 			newHorizPtr;
    AppleEHCIQueueHead *	pEHCIEndpointDescriptor;
    AppleEHCIListElement *	pLE;
    AppleUSBEHCIHubInfoPtr	hiPtr;

    if (_rootHubFuncAddress == functionAddress)
        return kIOReturnSuccess;

    USBLog(7, "%s[%p]::UIMCreateInterruptEndpoint (%d, %d, %s, %d, %d)", getName(), this,
          functionAddress, endpointNumber, (speed == kUSBDeviceSpeedLow) ? "lo" : "full", maxPacketSize,
          pollingRate);

    if( (speed == kUSBDeviceSpeedLow) && (maxPacketSize > 8) )
    {
	USBLog (1, "%s[%p]::UIMCreateInterruptEndpoint - incorrect max packet size (%d) for low speed", getName(), this, maxPacketSize);
	return kIOReturnBadArgument;
    }
    
    if(pollingRate == 0)
	return(kIOReturnBadArgument);

    // find my offset and check the HIGH SPEED bandwidth to the hub
    pollingRate = validatePollingRate(pollingRate, speed, &offset, &availableBandwidth);
        
    if (maxPacketSize > availableBandwidth)
    {
	USBLog (1, "%s[%p]::UIMCreateInterruptEndpoint - no bandwidth", getName(), this);
	return kIOReturnNoBandwidth;
    }
    
    if (highSpeedHub)
    {
	// get the "master" hub Info for this hub to check the flags
	hiPtr = GetHubInfo(highSpeedHub, 0);
	if (!hiPtr)
	{
	    // if there is no pointer, then i have to assume that this is a single TT hub
	    hiPtr = NewHubInfo(highSpeedHub, 0);
	    if (!hiPtr)
		return kIOReturnInternalError;
			USBLog (1, "%s[%p]::UIMCreateInterruptEndpoint - setting new hub info(%p) bandwidth to kUSBMaxIsocFrameReqCount", getName(), this, hiPtr);
			hiPtr->bandwidthAvailable = kUSBMaxIsocFrameReqCount;
		}
		if (hiPtr->flags & kUSBEHCIFlagsMuliTT)
		{
			// this is a multiTT hub
			hiPtr = GetHubInfo(highSpeedHub, highSpeedPort);
			if (!hiPtr)
			{
				// if there is no pointer, then i have to assume that this is a single TT hub
				hiPtr = NewHubInfo(highSpeedHub, highSpeedPort);
				if (!hiPtr)
					return kIOReturnInternalError;
				USBLog (1, "%s[%p]::UIMCreateInterruptEndpoint - setting new hub info(%p) bandwidth to kUSBMaxIsocFrameReqCount", getName(), this, hiPtr);
				hiPtr->bandwidthAvailable = kUSBMaxIsocFrameReqCount;
	    }
	}
	
	if (maxPacketSize > hiPtr->bandwidthAvailable)
	{
	    USBLog (1, "%s[%p]::UIMCreateInterruptEndpoint - split transaction - no bandwidth on hub or port (MPS %d, bw %d)", getName(), this, maxPacketSize, hiPtr->bandwidthAvailable);
	    return kIOReturnNoBandwidth;
	}
    
	hiPtr->bandwidthAvailable -= maxPacketSize;
	USBLog(5, "%s[%p]::UIMCreateInterruptEndpoint - using offset %d with HS bandwidth of %d and hub/port bandwidth of %d", getName(), this, offset, availableBandwidth, hiPtr->bandwidthAvailable);
    }
    else
    {
	USBLog(5, "%s[%p]::UIMCreateInterruptEndpoint - using offset %d with HS bandwidth of %d", getName(), this, offset, availableBandwidth);
    }
    

    pEHCIEndpointDescriptor = MakeEmptyIntEndPoint(functionAddress, endpointNumber, maxPacketSize, speed, highSpeedHub, highSpeedPort, direction);
             
    if (pEHCIEndpointDescriptor == NULL)
    {
        USBError(1, "%s[%p]::UIMCreateInterruptEndpoint - could not create empty endpoint", getName(), this);
	return kIOReturnNoResources;
    }

    pEHCIEndpointDescriptor->pollM1 = pollingRate-1;
    pEHCIEndpointDescriptor->offset = offset;
    pEHCIEndpointDescriptor->maxPacketSize = maxPacketSize;

    if(_greatestPeriod < pollingRate)
    {
	_greatestPeriod = pollingRate;
    }

    linkInterruptEndpoint(pEHCIEndpointDescriptor);

    USBLog(5, "-%s[%p]::UIMCreateInterruptEndpoint", getName(), this);
    return kIOReturnSuccess;
}


IOReturn 
AppleUSBEHCI::UIMCreateIsochEndpoint(short		functionAddress,
    short		endpointNumber,
    UInt32		maxPacketSize,
    UInt8		direction)
{
    USBError(1, "%s[%p]::UIMCreateIsochEndpoint -- old version called with no split params", getName(), this);
    return kIOReturnBadArgument;
}



IOReturn 
AppleUSBEHCI::UIMCreateIsochEndpoint(short					functionAddress,
									 short					endpointNumber,
									 UInt32					maxPacketSize,
									 UInt8					direction,
									 USBDeviceAddress    	highSpeedHub,
									 int               		highSpeedPort)
{
    USBError(1, "%s[%p]::UIMCreateIsochEndpoint -- old version called with no interval", getName(), this);
    return kIOReturnBadArgument;
}


IOReturn 
AppleUSBEHCI::UIMCreateIsochEndpoint(short					functionAddress,
									 short					endpointNumber,
									 UInt32					maxPacketSize,
									 UInt8					direction,
									 USBDeviceAddress    	highSpeedHub,
									 int               		highSpeedPort,
									 UInt8					interval)
{
    AppleEHCIIsochEndpointPtr	pEP;
    UInt32			curMaxPacketSize;
    AppleUSBEHCIHubInfoPtr	hiPtr;
    UInt32			xtraRequest;
    UInt16 			*bandWidthAvailPtr;
    UInt16 			highSpeedBandWidth;
    
