apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_UIM.cpp
    // we do not create an isoch endpoint in the hardware itself. isoch transactions are handled by 
    // TDs linked firectly into the Periodic List. There are two types of isoch TDs - split (siTD)
    // and high speed (iTD). This method will allocate an internal data structure which will be used
    // to track bandwidth, etc.

    USBLog(7, "%s[%p]::UIMCreateIsochEndpoint(%d, %d, %d, %d, %d, %d)", getName(), this, functionAddress, endpointNumber, maxPacketSize, direction, highSpeedHub, highSpeedPort);
    
    if (highSpeedHub == 0)
    {
        // Use a UInt16 to keep track of isoc bandwidth, then you can use
        // a pointer to it or to hiPtr->bandwidthAvailable for full speed.
        highSpeedBandWidth = _isochBandwidthAvail;
        bandWidthAvailPtr = &highSpeedBandWidth;
		if ((interval != 1) && (interval != 8))
		{
			USBError(1, "%s[%p]::UIMCreateIsochEndpoint: bad interval %d", getName(), this, interval);
			return kIOReturnBadArgument;
		}
    }
    else
    {
        // this is for full speed devices only - when HS is implemented, it should not use this code
        hiPtr = GetHubInfo(highSpeedHub, 0);
        if (!hiPtr)
        {
            // if there is no pointer, then i have to assume that this is a single TT hub
            hiPtr = NewHubInfo(highSpeedHub, 0);
            if (!hiPtr)
                return kIOReturnInternalError;
            USBLog (1, "%s[%p]::UIMCreateIsochEndpoint - setting new hub info(%p) bandwidth to kUSBMaxIsocFrameReqCount", getName(), this, hiPtr);
            hiPtr->bandwidthAvailable = kUSBMaxIsocFrameReqCount;
        }
        if (hiPtr->flags & kUSBEHCIFlagsMuliTT)
        {
            // this is a multiTT hub
            hiPtr = GetHubInfo(highSpeedHub, highSpeedPort);
            if (!hiPtr)
            {
                // if there is no pointer, then i have to create one for this port
                hiPtr = NewHubInfo(highSpeedHub, highSpeedPort);
                if (!hiPtr)
                    return kIOReturnInternalError;
                USBLog (1, "%s[%p]::UIMCreateIsochEndpoint - setting new hub info(%p) bandwidth to kUSBMaxIsocFrameReqCount", getName(), this, hiPtr);
                hiPtr->bandwidthAvailable = kUSBMaxIsocFrameReqCount;
            }
        }
        bandWidthAvailPtr = &hiPtr->bandwidthAvailable;
    }
    
    pEP = FindIsochronousEndpoint(functionAddress, endpointNumber, direction, NULL);

    if (pEP) 
    {
        // this is the case where we have already created this endpoint, and now we are adjusting the maxPacketSize
        //
        USBLog(6,"%s[%p]::UIMCreateIsochEndpoint endpoint already exists, changing maxPacketSize to %d",getName(), this, maxPacketSize);

        curMaxPacketSize = pEP->maxPacketSize;
	
        if (maxPacketSize == curMaxPacketSize) 
	{
            USBLog(4, "%s[%p]::UIMCreateIsochEndpoint maxPacketSize (%d) the same, no change",getName(), this, maxPacketSize);
            return kIOReturnSuccess;
        }
        if (maxPacketSize > curMaxPacketSize) 
	{
            // client is trying to get more bandwidth
            xtraRequest = maxPacketSize - curMaxPacketSize;
            if (xtraRequest > *bandWidthAvailPtr)
            {
                USBLog(1,"%s[%p]::UIMCreateIsochEndpoint out of bandwidth, request (extra) = %d, available: %d",getName(), this, xtraRequest, *bandWidthAvailPtr);
                return kIOReturnNoBandwidth;
            }
            *bandWidthAvailPtr -= xtraRequest;
            USBLog(5, "%s[%p]::UIMCreateIsochEndpoint grabbing additional bandwidth: %d, new available: %d",getName(), this, xtraRequest, *bandWidthAvailPtr);
        } else 
	{
            // client is trying to return some bandwidth
            xtraRequest = curMaxPacketSize - maxPacketSize;
            *bandWidthAvailPtr += xtraRequest;
            USBLog(5, "%s[%p]::UIMCreateIsochEndpoint returning some bandwidth: %d, new available: %d",getName(), this, xtraRequest, *bandWidthAvailPtr);
        }
        pEP->maxPacketSize = maxPacketSize;
        if (highSpeedHub == 0)
        {
            // Note new high speed bandwidth
            _isochBandwidthAvail = highSpeedBandWidth;
            
	    if(maxPacketSize >1024)
	    {
		pEP->mult = ((maxPacketSize-1)/1024)+1;
		pEP->oneMPS = (maxPacketSize+2)/pEP->mult;
	    }
	    else
	    {
		pEP->mult = 1;
		pEP->oneMPS = maxPacketSize;
	    }
            USBLog(5,"%s[%p]::UIMCreateIsochEndpoint high speed size %d, mult %d: %d",getName(), this, maxPacketSize, pEP->mult, pEP->oneMPS);
        }
        
        return kIOReturnSuccess;
    }
    
    // we neeed to create a new EP structure
    if (maxPacketSize > *bandWidthAvailPtr) 
    {
        USBLog(1,"%s[%p]::UIMCreateIsochEndpoint out of bandwidth, request (extra) = %d, available: %d",getName(), this, maxPacketSize, *bandWidthAvailPtr);
        return kIOReturnNoBandwidth;
    }

    pEP = CreateIsochronousEndpoint(functionAddress, endpointNumber, direction, highSpeedHub, highSpeedPort);
    if (pEP == NULL) 
        return kIOReturnNoMemory;

    pEP->inSlot = kEHCIPeriodicListEntries+1;
	pEP->interval = interval;


    *bandWidthAvailPtr -= maxPacketSize;
    pEP->maxPacketSize = maxPacketSize;
    
    USBLog(5, "%s[%p]::UIMCreateIsochEndpoint success. bandwidth used = %d, new available: %d",getName(), this, maxPacketSize, *bandWidthAvailPtr);
    if (highSpeedHub == 0)
    {
        // Note new Full speed bandwidth
        _isochBandwidthAvail = highSpeedBandWidth;
	
	if(maxPacketSize >1024)
	{
	    pEP->mult = ((maxPacketSize-1)/1024)+1;
	    pEP->oneMPS = (maxPacketSize+2)/pEP->mult;
	}
	else
	{
	    pEP->mult = 1;
	    pEP->oneMPS = maxPacketSize;
	}
			
		USBLog(5,"%s[%p]::UIMCreateIsochEndpoint high speed 2 size %d, mult %d: %d",getName(), this, maxPacketSize, pEP->mult, pEP->oneMPS);
    }
	
    return kIOReturnSuccess;
}



IOReturn 
AppleUSBEHCI::AbortIsochEP(AppleEHCIIsochEndpointPtr pEP)
{
    UInt32			slot;
    IOReturn			err;
    AppleEHCIIsochListElement	*pTD;
    AbsoluteTime		timeStamp;
    
