apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_UIM.cpp
    USBLog(5, "%s[%p] AppleUSBEHCI::HandleEndpointAbort: Addr: %d, Endpoint: %d,%d",getName(), this, functionAddress, endpointNumber, direction);

    if (functionAddress == _rootHubFuncAddress)
    {
        if ( (endpointNumber != 1) && (endpointNumber != 0) )
        {
            USBLog(1, "%s[%p::HandleEndpointAbort: bad params - endpNumber: %d", getName(), this, endpointNumber );
            return kIOReturnBadArgument;
        }
        
        // We call SimulateEDDelete (endpointNumber, direction) in 9
        //
        USBLog(5, "%s[%p]::HandleEndpointAbort: Attempting operation on root hub", getName(), this);
        return SimulateEDAbort( endpointNumber, direction);
    }

    piEP = FindIsochronousEndpoint(functionAddress, endpointNumber, direction, NULL);
    if (piEP)
    {
	return AbortIsochEP(piEP);
    }
    
    pED = FindControlBulkEndpoint (functionAddress, endpointNumber, &pEDQueueBack, direction);
    if(pED != NULL)
    {
	HaltAsyncEndpoint(pED, pEDQueueBack);
	returnTransactions(pED, NULL);				// this will unhalt the EP
	if (clearToggle)
	    pED->GetSharedLogical()->qTDFlags &= HostToUSBLong(~kEHCITDFlags_DT);	// Ensure that next TD is fetched (not the ALT) but keep the data toggle
    }
    else
    {
	pED = FindInterruptEndpoint(functionAddress, endpointNumber, direction, NULL);

	if(pED == NULL)
	{
	    USBLog(1, "AppleUSBEHCI::HandleEndpointAbort, endpoint not found");
	    return kIOUSBEndpointNotFound;
	}
	HaltInterruptEndpoint(pED);
	returnTransactions(pED, NULL);
    }

    return kIOReturnSuccess;

}



IOReturn 
AppleUSBEHCI::UIMAbortEndpoint(
    short			functionAddress,
    short			endpointNumber,
    short			direction)
{
    // this is probably not correct, but still waiting clarification on the EHCI spec section 4.8.2
    return HandleEndpointAbort(functionAddress, endpointNumber, direction, false);
}


IOReturn 
AppleUSBEHCI::UIMClearEndpointStall(
            short				functionAddress,
            short				endpointNumber,
            short				direction)
{
    
    USBLog(7, "%s[%p]::UIMClearEndpointStall - endpoint %d:%d", getName(), this, functionAddress, endpointNumber);
    return  HandleEndpointAbort(functionAddress, endpointNumber, direction, true);
}



AppleEHCIQueueHead *
AppleUSBEHCI::FindInterruptEndpoint(short functionNumber, short endpointNumber, short direction, AppleEHCIListElement * *pLEBack)
{
    UInt32			unique;
    AppleEHCIQueueHead *	pEDQueue;
    AppleEHCIListElement *	pListElementBack;
    AppleEHCIListElement *	pListElem;
    int 			i;

    unique = (UInt32) ((((UInt32) endpointNumber) << kEHCIEDFlags_ENPhase) | ((UInt32) functionNumber));
    pListElementBack = NULL;

    for(i= 0; i < _greatestPeriod; i++)
    {
	pListElem = OSDynamicCast(AppleEHCIListElement, _logicalPeriodicList[i]);
	while ( pListElem != NULL)
	{
	    pEDQueue = OSDynamicCast(AppleEHCIQueueHead, pListElem);
	    if (pEDQueue)
	{
	    if( ( (USBToHostLong(pEDQueue->GetSharedLogical()->flags) & kUniqueNumNoDirMask) == unique) && ( pEDQueue->direction == (UInt8)direction) ) 
	    {
		    if (pLEBack)
			*pLEBack = pListElementBack;
		    return  pEDQueue;
		}
	    }
	    pListElementBack = pListElem;
	    pListElem = OSDynamicCast(AppleEHCIListElement, pListElem->_logicalNext);
	} 
    }
    return  NULL;
}



IOReturn
AppleUSBEHCI::UIMCreateInterruptTransfer(IOUSBCommand* command)
{
    IOReturn				status = kIOReturnSuccess;
    AppleEHCIQueueHead *		pEDQueue;
    IOUSBCompletion			completion = command->GetUSLCompletion();
    IOMemoryDescriptor*			buffer = command->GetBuffer();
    short 				direction = command->GetDirection(); // our local copy may change

    USBLog(7, "%s[%p]::UIMCreateInterruptTransfer - adr=%d:%d cbp=%p:%lx br=%s cback=[%lx:%lx:%lx])", getName(), this,  
	    command->GetAddress(), command->GetEndpoint(), command->GetBuffer(), 
	    command->GetBuffer()->getLength(), command->GetBufferRounding()?"YES":"NO", 
	    (UInt32)completion.action, (UInt32)completion.target, 
	    (UInt32)completion.parameter);
    if (_rootHubFuncAddress == command->GetAddress())
    {
        SimulateRootHubInt(command->GetEndpoint(), buffer, buffer->getLength(), completion);
        return kIOReturnSuccess;
    }    

    pEDQueue = FindInterruptEndpoint(command->GetAddress(), command->GetEndpoint(), direction, NULL);
    if (!pEDQueue)
    {
	USBLog(1, "%s[%p]::UIMCreateInterruptTransfer - Endpoint not found", getName(), this);
	return kIOUSBEndpointNotFound;
    }

    status = allocateTDs(pEDQueue, command, buffer, command->GetBuffer()->getLength(), direction, false );
    if(status != kIOReturnSuccess)
    {
        USBLog(1, "%s[%p]::UIMCreateInterruptTransfer allocateTDs failed %x", getName(), this, status);
    }
    else
	EnablePeriodicSchedule();
    return status;
}



IOReturn
AppleUSBEHCI::UIMCreateInterruptTransfer(
    short				functionAddress,
    short				endpointNumber,
    IOUSBCompletion			completion,
    IOMemoryDescriptor *		CBP,
    bool				bufferRounding,
    UInt32				bufferSize,
    short				direction)
{
    // this is the old 1.8/1.8.1 method. It should not be used any more.
    USBLog(1, "%s(%p)UIMCreateInterruptTransfer- calling the wrong method!", getName(), this);
    return kIOReturnIPCError;
}




void 
AppleUSBEHCI::unlinkIntEndpoint(AppleEHCIQueueHead * pED)
{
    int 			i;
    AppleEHCIListElement *	pListElem;
    int				maxPacketSize;
    Boolean			foundED = false;
    
    USBLog(7, "+%s[%p]::unlinkIntEndpoint(%p)", getName(), this, pED);
    
    maxPacketSize   =  (USBToHostLong(pED->GetSharedLogical()->flags)  & kEHCIEDFlags_MPS) >> kEHCIEDFlags_MPSPhase;
    
    for(i= pED->offset; i < kEHCIPeriodicListEntries; i += pED->pollM1+1)
    {
	pListElem = OSDynamicCast(AppleEHCIListElement, _logicalPeriodicList[i]);
	if(pED == pListElem)
	{
	    _logicalPeriodicList[i] = pED->_logicalNext;
	    _periodicList[i] = pED->GetPhysicalLink();
	    foundED = true;
	    USBLog(6, "%s[%p]::unlinkIntEndpoint- found ED at top of list %d, new logical=%p, new physical=%p", getName(), this, i, _logicalPeriodicList[i], USBToHostLong(_periodicList[i]));
	}
	else
	{
	    while(pListElem != NULL)
	    {
		if(pListElem->_logicalNext == pED)
		{
		    pListElem->_logicalNext = pED->_logicalNext;
		    pListElem->SetPhysicalLink(pED->GetPhysicalLink());
		    foundED = true;
		    USBLog(6, "%s[%p]::unlinkIntEndpoint- found ED in list %d, new logical=%p, new physical=%p", getName(), this, i, pED->_logicalNext, USBToHostLong(pED->GetPhysicalLink()));
		    break;
		}
		pListElem = OSDynamicCast(AppleEHCIListElement, pListElem->_logicalNext);
	    }
	    if(pListElem == NULL)
	    {
		USBLog(2, "%s[%p]::unlinkIntEndpoint endpoint not found in list %d", getName(), this, i);
	    }
	
