apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_UIM.cpp
	}
	if (i < kEHCIMaxPoll)
	    _periodicBandwidth[i] += maxPacketSize;
    }

    IOSleep(1);				// make sure to clear the period list traversal cache
    pED->_logicalNext = NULL;
    
    if (foundED)
	_periodicEDsInSchedule--;

    USBLog(7, "-%s[%p]::unlinkIntEndpoint(%p)", getName(), this, pED);
}



void 
AppleUSBEHCI::unlinkAsyncEndpoint(AppleEHCIQueueHead * pED, AppleEHCIQueueHead * pEDQueueBack)
{
    UInt32 CMD, STS, count;

    if( (pEDQueueBack == NULL) && (pED->_logicalNext == NULL) )
    {
        USBLog(7, "%s[%p]::unlinkAsyncEndpoint: removing sole endpoint %lx", getName(),this, (long)pED);
	// this is the only endpoint in the queue. we will leave list processing disabled
	DisableAsyncSchedule();
	printAsyncQueue();
	_AsyncHead = NULL;
	_pEHCIRegisters->AsyncListAddr = 0;
	printAsyncQueue();
    }
    else
    {
	USBLog(7, "%s[%p]::unlinkAsyncEndpoint: removing endpoint from queue %lx", getName(),this, (long)pED);

	// have to take this out of the queue
	
	if(_AsyncHead == pED)
	{
	    // this is the case where we are taking the head of the queue, but it is not the
	    // only element left in the queue
	    if (pEDQueueBack)
	    {
		USBError(1, "%s[%p]::unlinkAsyncEndpoint: ERROR - pEDQueueBack should be NULL at this point", getName(),this );
	    }
	    // we need to find the last ED in the logical list, so that we can link in the "wrap around" physical pointer
	    pEDQueueBack = OSDynamicCast(AppleEHCIQueueHead, pED->_logicalNext);
	    while (pEDQueueBack->_logicalNext)
		pEDQueueBack = OSDynamicCast(AppleEHCIQueueHead, pEDQueueBack->_logicalNext);
//	    DisableAsyncSchedule();
	    printAsyncQueue();
	    _AsyncHead = OSDynamicCast(AppleEHCIQueueHead, pED->_logicalNext);
	    _pEHCIRegisters->AsyncListAddr = HostToUSBLong(pED->_logicalNext->_sharedPhysical);
	    pEDQueueBack->GetSharedLogical()->nextQH = HostToUSBLong(pED->_logicalNext->GetPhysicalAddrWithType());
	    pED = OSDynamicCast(AppleEHCIQueueHead , pED->_logicalNext); 
	    pED->GetSharedLogical()->flags |= HostToUSBLong(kEHCIEDFlags_H);
	    printAsyncQueue();
//	    EnableAsyncSchedule();
	}
	else if(pEDQueueBack != NULL)
	{
//	    DisableAsyncSchedule();
	    printAsyncQueue();
	    pEDQueueBack->GetSharedLogical()->nextQH = pED->GetSharedLogical()->nextQH;
	    pEDQueueBack->_logicalNext = pED->_logicalNext;
	    printAsyncQueue();
//	    EnableAsyncSchedule();
	}
	else
	{
	    USBLog(7, "%s[%p]::unlinkAsyncEndpoint: ED not head, but pEDQueueBack not NULL", getName(),this);
	}

	// ED is unlinked, now tell controller
	CMD = USBToHostLong(_pEHCIRegisters->USBCMD);
	_pEHCIRegisters->USBCMD = HostToUSBLong(CMD | kEHCICMDAsyncDoorbell);
	
	// Wait for controller to acknowledge
	STS = USBToHostLong(_pEHCIRegisters->USBSTS);
	count = 0;
	while((STS & kEHCIAAEIntBit) == 0)
	{
		IOSleep(1);
		STS = USBToHostLong(_pEHCIRegisters->USBSTS);
		count++;
                if ( count > 10000)
                {
                    // Bail out after 10 seconds
                    break;
                }
	};
	USBLog(5, "%s[%p]::unlinkAsyncEndpoint: delayed for %d", getName(),this, count);
	
	// Clear request
	_pEHCIRegisters->USBSTS = HostToUSBLong(kEHCIAAEIntBit);
    }
}	



IOReturn
AppleUSBEHCI::DeleteIsochEP(AppleEHCIIsochEndpointPtr pEP)
{
    AppleEHCIIsochEndpointPtr 		curEP, prevEP;
    
    USBLog(7, "%s[%p]::DeleteIsochEP (%p)", getName(), this, pEP);
    if (pEP->activeTDs)
    {
	USBLog(6, "%s[%p]::DeleteIsochEP- there are still %d active TDs - aborting", getName(), this, pEP->activeTDs);
	AbortIsochEP(pEP);
	if (pEP->activeTDs)
	{
	    USBLog(3, "%s[%p]::DeleteIsochEP- after abort there are STILL %d active TDs", getName(), this, pEP->activeTDs);
	}
    }
    prevEP = NULL;
    curEP = _isochEPList;
    while (curEP)
    {
	if (curEP == pEP)
	{
	    if (prevEP)
		prevEP->nextEP = curEP->nextEP;
	    else
		_isochEPList = curEP->nextEP;
	    break;
	}
	prevEP = curEP;
	curEP = curEP->nextEP;
    }
    
    // need to return the bandwidth used
    if (pEP->highSpeedHub == 0)
    {
	_isochBandwidthAvail += pEP->maxPacketSize;
    }
    else
    {
        AppleUSBEHCIHubInfoPtr		hiPtr;
        
        hiPtr = GetHubInfo(pEP->highSpeedHub, pEP->highSpeedPort);
        if (!hiPtr)
        {
            // must be a single TT hub
            hiPtr = GetHubInfo(pEP->highSpeedHub, 0);
        }
        if (hiPtr)
        {
            USBLog(5, "%s[%p]::DeleteIsochEP - returning bandwidth (%d) - new bandwidth (%d)", getName(), this, pEP->maxPacketSize, hiPtr->bandwidthAvailable + pEP->maxPacketSize);
            hiPtr->bandwidthAvailable += pEP->maxPacketSize;
        }
    }
    return kIOReturnSuccess;
}



IOReturn 
AppleUSBEHCI::UIMDeleteEndpoint(
    short				functionAddress,
    short				endpointNumber,
    short				direction)
{
    AppleEHCIQueueHead  		*pED;
    AppleEHCIQueueHead  		*pEDQueueBack;
    AppleEHCIIsochEndpointPtr		piEP;

    USBLog(7, "%s[%p] AppleUSBEHCI::UIMDeleteEndpoint: Addr: %d, Endpoint: %d,%d",getName(), this, functionAddress,endpointNumber,direction);
    
    if (functionAddress == _rootHubFuncAddress)
    {
        if ( (endpointNumber != 1) && (endpointNumber != 0) )
        {
            USBLog(1, "%s[%p] UIMDeleteEndpoint: bad params - endpNumber: %d", getName(), this, endpointNumber );
            return kIOReturnBadArgument;
        }
        
        // We call SimulateEDDelete (endpointNumber, direction) in 9
        //
        USBLog(5, "%s[%p] UIMDeleteEndpoint: Attempting operation on root hub", getName(), this);
        return SimulateEDDelete( endpointNumber, direction);
    }

    piEP = FindIsochronousEndpoint(functionAddress, endpointNumber, direction, NULL);
    if (piEP)
	return DeleteIsochEP(piEP);
    
    pED = FindControlBulkEndpoint (functionAddress, endpointNumber, &pEDQueueBack, direction);
    
    if(pED == NULL)
    {
	UInt32				splitFlags;
	USBDeviceAddress		highSpeedHub;
	UInt8				highSpeedPort;
        AppleUSBEHCIHubInfoPtr		hiPtr;
	
	pED = FindInterruptEndpoint(functionAddress, endpointNumber, direction, NULL);
	if(pED == NULL)
	{
	    USBLog(2, "AppleUSBEHCI::UIMDeleteEndpoint, endpoint not found");
	    return kIOUSBEndpointNotFound;
	}
	USBLog(5, "%s[%p]::UIMDeleteEndpoint: deleting Int endpoint", getName(), this);
	unlinkIntEndpoint(pED);
	if (!_periodicEDsInSchedule)
	{
	    USBLog(3, "%s[%p]::UIMDeleteEndpoint: $$$$$$ all EDs gone from periodic schedule, disabling", getName(), this, _periodicEDsInSchedule);
	    DisablePeriodicSchedule();
	}
	splitFlags = USBToHostLong(pED->GetSharedLogical()->splitFlags);
	highSpeedHub = (splitFlags & kEHCIEDSplitFlags_HubAddr) >> kEHCIEDSplitFlags_HubAddrPhase;
	highSpeedPort = (splitFlags & kEHCIEDSplitFlags_Port) >> kEHCIEDSplitFlags_PortPhase;
        hiPtr = GetHubInfo(highSpeedHub, highSpeedPort);
        if (!hiPtr)
        {
            // must be a single TT hub
            hiPtr = GetHubInfo(highSpeedHub, 0);
        }
        if (hiPtr)
        {
            USBLog(5, "%s[%p]::UIMDeleteEndpoint - returning bandwidth (%d) - new bandwidth (%d)", getName(), this, pED->maxPacketSize, hiPtr->bandwidthAvailable + pED->maxPacketSize);
            hiPtr->bandwidthAvailable += pED->maxPacketSize;
        }
    }
    else
    {
	USBLog(5, "%s[%p] UIMDeleteEndpoint: deleting async endpoint", getName(), this);
	unlinkAsyncEndpoint(pED, pEDQueueBack);
    }
    
    if(pED->qTD != pED->TailTD)		// There are transactions on this queue
    {
        USBLog(5, "%s[%p] UIMDeleteEndpoint: removing TDs", getName(), this);
        EHCIUIMDoDoneQueueProcessing(pED->qTD, kIOUSBTransactionReturned, NULL, pED->TailTD);
        pED->qTD = pED->TailTD;
        pED->GetSharedLogical()->NextqTDPtr = HostToUSBLong(pED->qTD->pPhysical);
    }
    
    USBLog(5, "%s[%p] AppleUSBEHCI::UIMDeleteEndpoint: Deallocating %p",getName(), this, pED);
    DeallocateED(pED);
    
