apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_UIM.cpp
    return kIOReturnSuccess;
}



IOReturn
AppleUSBEHCI::CreateHSIsochTransfer(	AppleEHCIIsochEndpointPtr	pEP,
					IOUSBIsocCompletion		completion,
					UInt64 				frameNumberStart,
					IOMemoryDescriptor 		*pBuffer,
					UInt32 				frameCount,
					IOUSBLowLatencyIsocFrame	*pFrames,
					UInt32 				updateFrequency,
					Boolean 			lowLatency)
{
    UInt64 				curFrameNumber = GetFrameNumber();
    UInt64 				maxOffset;
    UInt32 				bufferSize;
    AppleEHCIIsochTransferDescriptor 	*pNewITD = NULL;
    IOByteCount 			transferOffset;
    unsigned 				i,j;
    UInt32 				*buffP, *TransactionP = 0;
    UInt32 				pageOffset;
    UInt32 				page;
    UInt32 				frames;
    UInt32 				trLen;
    UInt64 				frameDiff;
    UInt32 				diff32;
    IOUSBIsocFrame			*pHLFrames;
    IOPhysicalAddress			dmaStartAddr;
    IOByteCount segLen;
    
#if 0
	// JRH - 9/21/04 - this is a bogus check
    if( (frameCount % 8) != 0 )
	{
        USBLog(3,"%s[%p]::UIMCreateIsochTransfer frameCount not whole frame: %d",getName(), this, frameCount);
        return kIOReturnBadArgument;
	}
#endif

    maxOffset = _frameListSize;
    if (frameNumberStart <= curFrameNumber)
    {
        if (frameNumberStart < (curFrameNumber - maxOffset))
        {
            USBLog(3,"%s[%p]::UIMCreateIsochTransfer request frame WAY too old.  frameNumberStart: %ld, curFrameNumber: %ld.  Returning 0x%x",getName(), this, (UInt32) frameNumberStart, (UInt32) curFrameNumber, kIOReturnIsoTooOld);
            return kIOReturnIsoTooOld;
        }
        USBLog(5,"%s[%p]::UIMCreateIsochTransfer WARNING! curframe later than requested, expect some notSent errors!  frameNumberStart: %ld, curFrameNumber: %ld.  USBIsocFrame Ptr: %p, First ITD: %p",getName(), this, (UInt32) frameNumberStart, (UInt32) curFrameNumber, pFrames, pEP->toDoEnd);
    } 
	else 
    {					// frameNumberStart > curFrameNumber
        if (frameNumberStart > (curFrameNumber + maxOffset))
        {
            USBLog(3,"%s[%p]::UIMCreateIsochTransfer request frame too far ahead!  frameNumberStart: %ld, curFrameNumber: %ld",getName(), this, (UInt32) frameNumberStart, (UInt32) curFrameNumber);
            return kIOReturnIsoTooNew;
        }
        frameDiff = frameNumberStart - curFrameNumber;
        diff32 = (UInt32)frameDiff;
        if (diff32 < 2)
        {
            USBLog(5,"%s[%p]::UIMCreateIsochTransfer WARNING! - frameNumberStart less than 2 ms (is %ld)!  frameNumberStart: %ld, curFrameNumber: %ld",getName(), this, (UInt32) diff32, (UInt32) frameNumberStart, (UInt32) curFrameNumber);
        }
    }

    // Format all the TDs, attach them to the pseudo endpoint. 
    // let the frame interrupt routine put them in the periodic list

	frames = 100;
    transferOffset = 0;
	pHLFrames = (IOUSBIsocFrame *)pFrames;
	
    // Do this one frame, 8 micro frames, at a time
    while(frameCount > 0)
    {
        //
        //  Get the size of buffer for this frame
        //
        bufferSize = 0;
        for ( i = 0; i < 8; i += pEP->interval)
        {
            if(frameCount < i)
            {
                break;
            }
    
			if(lowLatency)
			{
				if (pFrames[i].frReqCount > kUSBMaxHSIsocFrameReqCount)
				{
					USBLog(3,"%s[%p]::UIMCreateIsochTransfer Isoch frame too big %d",getName(), this, pFrames[i].frReqCount);
					return kIOReturnBadArgument;
				}
				bufferSize += pFrames[i].frReqCount; 
			}
			else
			{
				if (pHLFrames[i].frReqCount > kUSBMaxHSIsocFrameReqCount)
				{
					USBLog(3,"%s[%p]::UIMCreateIsochTransfer Isoch frame too big %d",getName(), this, pHLFrames[i].frReqCount);
					return kIOReturnBadArgument;
				}
				bufferSize += pHLFrames[i].frReqCount; 
			
			}
        }
    
        //
        // go ahead and make sure we can grab at least ONE TD, before we lock the buffer	
        //
        pNewITD = AllocateITD();
        USBLog(7, "%s[%p]::UIMCreateIsochTransfer - new iTD %p", getName(), this, pNewITD);
        if (pNewITD == NULL)
        {
            USBLog(1,"%s[%p]::UIMCreateIsochTransfer Could not allocate a new iTD",getName(), this);
            return kIOReturnNoMemory;
        }
		
		pNewITD->lowLatency = lowLatency;
    
		// initialize the page pointers to zero length
		pNewITD->GetSharedLogical()->Transaction0 = NULL;
		pNewITD->GetSharedLogical()->Transaction1 = NULL;
		pNewITD->GetSharedLogical()->Transaction2 = NULL;
		pNewITD->GetSharedLogical()->Transaction3 = NULL;
		pNewITD->GetSharedLogical()->Transaction4 = NULL;
		pNewITD->GetSharedLogical()->Transaction5 = NULL;
		pNewITD->GetSharedLogical()->Transaction6 = NULL;
		pNewITD->GetSharedLogical()->Transaction7 = NULL;
		
		// set up all the physical page pointers
	buffP = &pNewITD->GetSharedLogical()->bufferPage0;
	dmaStartAddr = pBuffer->getPhysicalSegment(transferOffset, &segLen);
	pageOffset = dmaStartAddr & kEHCIPageOffsetMask;
		USBLog(4, "%s[%p]::CreateHSIsochTransfer - Addr (%p) Length (%d) BufferSize (%d)", getName(), this, dmaStartAddr, segLen, bufferSize);
		if(segLen > bufferSize)
		{
			segLen = bufferSize;
		}
		if(segLen > (kEHCIPageSize-pageOffset))
		{
			segLen = kEHCIPageSize-pageOffset;
		}
		
		*(buffP++) = HostToUSBLong( dmaStartAddr & kEHCIPageMask);
		USBLog(4, "%s[%p]::CreateHSIocTransfer - getPhysicalSegment returned start of %p; length:%ld ; Buff Ptr0:%lx", getName(), this, dmaStartAddr, segLen, *(buffP-1));
		transferOffset += segLen;
		bufferSize -= segLen;
		
		for(j=1; j <= 6; j++)
		{
			if(bufferSize == 0)
	    {
		*(buffP++) = 0;
		continue;
	    }
	    dmaStartAddr = pBuffer->getPhysicalSegment(transferOffset, &segLen);
	    *(buffP++) = HostToUSBLong( dmaStartAddr & kEHCIPageMask);
			// pageOffset = dmaStartAddr & kEHCIPageOffsetMask;
			if((dmaStartAddr & kEHCIPageOffsetMask) != 0)
	    {
		USBError(1, "%s[%p]::CreateHSIocTransfer - pageOffset not zero in %dth buff: %p", getName(), this, j, dmaStartAddr);
	    }
	    if(segLen > bufferSize)
	    {
		segLen = bufferSize;
	    }
	    if(segLen > kEHCIPageSize)
	    {
		segLen = kEHCIPageSize;
	    }
	    transferOffset += segLen;
	    bufferSize -= segLen;
			USBLog(4, "%s[%p]::CreateHSIocTransfer - getPhysicalSegment returned start of %p;  length:%d ; Buff Ptr%d:%p", getName(), this, dmaStartAddr, segLen, j, USBToHostLong(*(buffP-1)));
	}

    //    return kIOReturnNoMemory;
        page = 0;
        TransactionP = &pNewITD->GetSharedLogical()->Transaction0;
	if(lowLatency)
	{
	    pNewITD->myFrames = (IOUSBIsocFrame *)pFrames;	// Points to the 8 frames structure for the 8 frames in this micro frame
	}
	else
	{
	    pNewITD->myFrames = pHLFrames;	// Points to the 8 frames structure for the 8 frames in this micro frame
	}
        for ( i = 0; i< 8; i += pEP->interval)
        {
            if(frameCount < i)
            {
                break;
            }
			
			if(lowLatency)
			{
				trLen = (pFrames++)->frReqCount;
			}
			else
			{
				trLen = (pHLFrames++)->frReqCount;
			}
            // Len already checked above
            USBLog(4, "%s[%p]::CreateHSIsochTransfer - forming transaction length (%d), pageOffset (%p), page (%d)", getName(), this, trLen, pageOffset, page);
            *(TransactionP++) = HostToUSBLong(kEHCI_ITDStatus_Active |  (trLen<< kEHCI_ITDTr_LenPhase) | 
                                        (pageOffset << kEHCI_ITDTr_OffsetPhase) | (page << kEHCI_ITDTr_PagePhase) );

			// This gets filled in later for the last one.
            pNewITD->completion.action = NULL;

            pageOffset += trLen;
            if(pageOffset > kEHCIPageSize)
            {
                pageOffset -= kEHCIPageSize;
                page++;
            }
        }
		
		
        if(frameCount > (UInt32)(8 / pEP->interval))
        {
            frameCount -= (8 / pEP->interval);
        }
        else
        {
            frameCount = 0;
        }

