apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_UIM.cpp
	pEP->firstAvailableFrame++;
        pNewSITD->lowLatency = lowLatency;
    
	// set up the physical page pointers

	dmaStartAddr = pBuffer->getPhysicalSegment(transferOffset, &segLen);
	pageOffset = dmaStartAddr & kEHCIPageOffsetMask;
	if(segLen > reqCount)
	{
	    segLen = reqCount;
	}
	if(segLen > (kEHCIPageSize-pageOffset))
	{
	    segLen = kEHCIPageSize-pageOffset;
	}
	pNewSITD->GetSharedLogical()->buffPtr0 = HostToUSBLong(dmaStartAddr);
	USBLog(7, "%s[%p]::CreateSplitIocTransfer - getPhysicalSegment returned start of %p; length %ld", getName(), this, dmaStartAddr, segLen);

	transferOffset += segLen;
	bufferSize -= segLen;
        reqLeft = reqCount - segLen;

	if(reqLeft==0)
	{
	    pNewSITD->GetSharedLogical()->buffPtr1 = 0;
	}
	else
	{
	    dmaStartAddr = pBuffer->getPhysicalSegment(transferOffset, &segLen);
	    pNewSITD->GetSharedLogical()->buffPtr1 = HostToUSBLong(dmaStartAddr & kEHCIPageMask);
	    if(segLen > reqLeft)
	    {
		segLen = reqLeft;
	    }
	    if(segLen > kEHCIPageSize)
	    {
		segLen = kEHCIPageSize;
	    }
	    USBLog(7, "%s[%p]::CreateSplitIocTransfer - getPhysicalSegment returned start of %p; length %ld", getName(), this, dmaStartAddr, segLen);
	    transferOffset += segLen;
	    bufferSize -= segLen;
	}

        pNewSITD->myFrames = pFrames;
        pNewSITD->frameNumber = frameNumberStart + i;
	pNewSITD->frameIndex = i;
        
        // calculate start split and complete split flags
	// 3625645 (replacement for old bug fix for 3273910)
	// Theory of the start/complete splits - new on 04/21/04 - JRH
	// We will handle all of the IN transactions at the beginning of the frame. This means that we will issue a Start Split for each IN
	// transaction on microframe 0, skip microframe 1, and then issue Complete Splits on microframes 2-7.
	// We will handle the OUT transactions at the END of the frame but not all the way at the end. We can't send too much in microframe 7,
	// so we will schedule OUT packets so that the final one goes out on microframe 6
	if (pEP->direction == kUSBOut)
	{
	    completeSplitFlags = 0;				// dont use complete split for OUT transactions
	    if (reqCount > 188)
	    {
		transactionCount = (reqCount + 187) / 188;	// number of 188 byte transfers
		transactionPosition = 1;			// beginning of a multi-part transfer
		startSplitFlags = ((2 << transactionCount) - 1) << (7-transactionCount);	// bitmask of bits to send SSplit on (finishing with microframe 6)
	    }
	    else
	    {
                startSplitFlags = 0x40;				// Start it on microframe 6
		transactionPosition = 0;			// total transfer is in this microframe
		transactionCount = 1;				// only need one transfer
	    }
	}
	else
	{
	    // IN transactions
	    startSplitFlags = 1;				// issue the SSplit on microframe 0
	    transactionPosition = 0;				// only used for OUT
	    transactionCount = 0;				// only used for OUT
	    completeSplitFlags = 0xFC;				// allow completes on 2,3,4,5,6,7
	}
        
        // calculate IOC and completion if necessary
	if (i == (frameCount-1))
	{
	    ioc = 1;
	    pNewSITD->completion = completion;
	}
	else if (lowLatency)
	{
	    if (!updateFrequency)
		ioc = (((i+1) % 8) == 0) ? 1 : 0;
	    else
		ioc = (((i+1) % updateFrequency) == 0) ? 1 : 0;
	}
	else
	    ioc = 0;

        pNewSITD->GetSharedLogical()->nextSITD = HostToUSBLong(kEHCITermFlag); 
        pNewSITD->GetSharedLogical()->routeFlags = HostToUSBLong(((pEP->direction == kUSBOut) ? 0 : (1 << kEHCIsiTDRouteDirectionPhase))
                                    |	(pEP->highSpeedPort <<  kEHCIsiTDRoutePortNumberPhase)
                                    |	(pEP->highSpeedHub <<  kEHCIsiTDRouteHubAddrPhase)
                                    |	(pEP->endpointNumber <<  kEHCIsiTDRouteEndpointPhase)
                                    |	(pEP->functionAddress << kEHCIsiTDRouteDeviceAddrPhase)
                                    );
		
        pNewSITD->GetSharedLogical()->timeFlags = HostToUSBLong((completeSplitFlags << kEHCIsiTDTimeCMaskPhase) 
				    | 	(startSplitFlags << kEHCIsiTDTimeSMaskPhase)
					);
		
        pNewSITD->GetSharedLogical()->statFlags = HostToUSBLong((ioc << kEHCIsiTDStatIOCPhase) 
				    | 	(reqCount << kEHCIsiTDStatLengthPhase)
				    |	(kEHCIsiTDStatStatusActive)
					);
        pNewSITD->GetSharedLogical()->buffPtr1 |= HostToUSBLong(	// Buff pointer already set up
					(transactionPosition << kEHCIsiTDBuffPtr1TPPhase)
			|	(transactionCount));
        pNewSITD->GetSharedLogical()->backPtr = HostToUSBLong(kEHCITermFlag);
        pNewSITD->myEndpoint = pEP;
	
	PutTDonToDoList(pEP, pNewSITD);
    }
    AddIsocFramesToSchedule(pEP);
    EnablePeriodicSchedule();
	
    return kIOReturnSuccess;
}



// this is the non Low Latency case
IOReturn
AppleUSBEHCI::UIMCreateIsochTransfer(	short  			functionAddress,
					short 			endpointNumber,
					IOUSBIsocCompletion 	completion,
					UInt8 			direction,
					UInt64 			frameStart,
					IOMemoryDescriptor 	*pBuffer,
					UInt32 			frameCount,
					IOUSBIsocFrame 		*pFrames)
{
    AppleEHCIIsochEndpointPtr		pEP;

    USBLog(7, "%s[%p]::UIMCreateIsochTransfer - adr=%d:%d cbp=%p:%lx (cback=[%lx:%lx:%lx])", getName(), this,  
	    functionAddress, endpointNumber, pBuffer, 
	    pBuffer->getLength(), 
	    (UInt32)completion.action, (UInt32)completion.target, 
	    (UInt32)completion.parameter);

    if ( (frameCount == 0) || (frameCount > 1000) )
    {
        USBLog(3,"%s[%p]::UIMCreateIsochTransfer bad frameCount: %d",getName(), this, frameCount);
        return kIOReturnBadArgument;
    }

    pEP = FindIsochronousEndpoint(functionAddress, endpointNumber, direction, NULL);
    if(pEP == NULL)
    {
        USBLog(1, "%s[%p]::UIMCreateIsochTransfer - Endpoint not found", getName(), this);
        return kIOUSBEndpointNotFound;        
    }
    
    if (pEP->highSpeedHub)
	return CreateSplitIsochTransfer(pEP, completion, frameStart, pBuffer, frameCount, pFrames);
    else
		return CreateHSIsochTransfer(pEP, completion, frameStart, pBuffer, frameCount, (IOUSBLowLatencyIsocFrame*)pFrames);
}



