apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_UIM.cpp
// this is the Low Latency case
IOReturn
AppleUSBEHCI::UIMCreateIsochTransfer(	short						functionAddress,
										short						endpointNumber,
										IOUSBIsocCompletion			completion,
										UInt8						direction,
										UInt64						frameNumberStart,
										IOMemoryDescriptor			*pBuffer,
										UInt32						frameCount,
										IOUSBLowLatencyIsocFrame	*pFrames,
										UInt32						updateFrequency)
{
    AppleEHCIIsochEndpointPtr		pEP;
	
    USBLog(7, "%s[%p]::UIMCreateIsochTransfer - adr=%d:%d cbp=%p:%lx (cback=[%lx:%lx:%lx])", getName(), this, functionAddress, endpointNumber, pBuffer, pBuffer->getLength(), (UInt32)completion.action, (UInt32)completion.target, (UInt32)completion.parameter);
    if ( (frameCount == 0) || (frameCount > 1000) )
    {
        USBLog(3,"%s[%p]::UIMCreateIsochTransfer bad frameCount: %d",getName(), this, frameCount);
        return kIOReturnBadArgument;
    }
    pEP = FindIsochronousEndpoint(functionAddress, endpointNumber, direction, NULL);

    if(pEP == NULL)
    {
        USBLog(1, "%s[%p]::UIMCreateIsochTransfer - Endpoint not found", getName(), this);
        return kIOUSBEndpointNotFound;        
    }
    
    if (pEP->highSpeedHub)
	return CreateSplitIsochTransfer(pEP, completion, frameNumberStart, pBuffer, frameCount, (IOUSBIsocFrame*)pFrames, updateFrequency, true);
    else
		return CreateHSIsochTransfer(pEP, completion, frameNumberStart, pBuffer, frameCount, pFrames, updateFrequency, true);
}



void 
AppleUSBEHCI::AddIsocFramesToSchedule(AppleEHCIIsochEndpointPtr pEP)
{
    UInt64 				currFrame;
    AppleEHCIIsochListElement		*pTD;
    UInt16 				nextSlot;
    AbsoluteTime    timeStamp;

    pTD = GetTDfromToDoList(pEP);
    if(pTD == NULL)
    {
	USBLog(7, "%s[%p]::AddIsocFramesToSchedule - no frames to add fn:%d EP:%d", getName(), this, pEP->functionAddress, pEP->endpointNumber);
	return;
    }

    // Don't get GetFrameNumber() unless we're going to use it
    //
    currFrame = GetFrameNumber();
    
    USBLog(7, "%s[%p]::AddIsocFramesToSchedule - fn:%d EP:%d inSlot (0x%x), currFrame: 0x%Lx", getName(), this, pEP->functionAddress, pEP->endpointNumber, pEP->inSlot, currFrame);
    clock_get_uptime(&timeStamp);
    while(pTD->frameNumber <= (currFrame+1))	// Add 1, and use <= so you never put in a new frame 
						// at less than 2 ahead of now. (EHCI spec, 7.2.1)
    {
	IOReturn	ret;
	
	// this transaction is old before it began, move to done queue
		USBLog(7, "%s[%p]::AddIsocFramesToSchedule - ignoring TD(%p) because it is way too old (%Lx) vs (%Lx) ", getName(), this, pTD, pTD->frameNumber, currFrame);
		ret = pTD->UpdateFrameList(timeStamp);		// TODO - accumulate the return values
	PutTDonDeferredQueue(pEP, pTD);
	    
	pTD = GetTDfromToDoList(pEP);
        USBLog(7, "%s[%p]::AddIsocFramesToSchedule - pTD = %p", getName(), this, pTD);
	if(pTD == NULL)
	{	
	    // Run out of transactions to move.  Call this on a separate thread so that we return to the caller right away
            // 
	    // ReturnIsocDoneQueue(pEP);
            USBLog(7, "%s[%p]::AddIsocFramesToSchedule - calling the ReturnIsocDoneQueue on a separate thread", getName(), this);
            thread_call_enter1(_processDoneQueueThread, (thread_call_param_t) pEP);
	    return;
	}
    }
    
    currFrame = pTD->frameNumber;		// start looking at the first available number
    
    // This needs to be fixed up when we have variable length lists.
    pEP->inSlot = currFrame & (kEHCIPeriodicListEntries-1);

    do
    {
	nextSlot = (pEP->inSlot + 1) & (kEHCIPeriodicListEntries-1);
	if( nextSlot == _outSlot) 								// weve caught up with our tail
	{
			USBLog(7, "%s[%p]::AddIsocFramesToSchedule - caught up nextSlot (0x%x) _outSlot (0x%x)", getName(), this, nextSlot, _outSlot);
			break;
		}
		
		USBLog(7, "%s[%p]::AddIsocFramesToSchedule - checking TD(%p) FN(0x%Lx) against currFrame (0x%Lx)", getName(), this, pTD, pTD->frameNumber, currFrame);
	if(currFrame == pTD->frameNumber)
	{
	    if(_outSlot > kEHCIPeriodicListEntries)
	    {
		_outSlot = pEP->inSlot;
	    }
	    // Place TD in list
			USBLog(7, "%s[%p]::AddIsocFramesToSchedule - linking TD (%p) with frame (0x%Lx) into slot (0x%x) - curr next log (%p) phys (%p)", getName(), 
								this, pTD, pTD->frameNumber, pEP->inSlot, _logicalPeriodicList[pEP->inSlot], USBToHostLong(_periodicList[pEP->inSlot]));
	    pTD->SetPhysicalLink(_periodicList[pEP->inSlot]);
	    pTD->_logicalNext = _logicalPeriodicList[pEP->inSlot];
	    _logicalPeriodicList[pEP->inSlot] = pTD;
	    _periodicList[pEP->inSlot] = HostToUSBLong(pTD->GetPhysicalAddrWithType());
			USBLog(7, "%s[%p]::AddIsocFramesToSchedule - _periodicList[%x]:%x", getName(), this, pEP->inSlot, USBToHostLong(_periodicList[pEP->inSlot]));
		
	    // pTD->print();
	    // and fetch the next one
	    pTD = GetTDfromToDoList(pEP);
	}
	currFrame++;
	pEP->inSlot = nextSlot;
		USBLog(7, "%s[%p]::AddIsocFramesToSchedule - pEP->inSlot is now 0x%x", getName(), this, pEP->inSlot);	
    } while(pTD != NULL);

    USBLog(7, "%s[%p]::AddIsocFramesToSchedule - finished,  currFrame: %Lx", getName(), this, GetFrameNumber() );

}



void
AppleUSBEHCI::ProcessDoneQueueEntry(OSObject *target, thread_call_param_t endpointPtr)
{
    AppleUSBEHCI *	me = OSDynamicCast(AppleUSBEHCI, target);
    AppleEHCIIsochEndpointPtr 	pEP = (AppleEHCIIsochEndpointPtr) endpointPtr;

    if (!me || !pEP)
        return;

    me->retain();
    me->ReturnIsocDoneQueue(pEP);
    me->release();
}

void 
AppleUSBEHCI::ReturnIsocDoneQueue(AppleEHCIIsochEndpointPtr pEP)
{
    AppleEHCIIsochListElement		 	*pTD = GetTDfromDoneQueue(pEP);
    IOUSBIsocFrame 				*pFrames;
    
    USBLog(7, "%s[%p]::ReturnIsocDoneQueue (%p)", getName(), this, pEP);
    if (pTD)
    {
	// HS always stores the big frame pointer in the first TD
	pFrames = pTD->myFrames;
    }
    while(pTD)
    {
	if( pTD->completion.action != NULL)
	{
	    IOUSBIsocCompletionAction 	pHandler;
	    
	    pHandler = pTD->completion.action;
	    pTD->completion.action = NULL;
	    USBLog(7, "%s[%p]::ReturnIsocDoneQueue- calling handler(%p, %p, %p, %p)", getName(), this, pTD->completion.target, pTD->completion.parameter, pEP->accumulatedStatus, pFrames);
	    (*pHandler) (pTD->completion.target,  pTD->completion.parameter, pEP->accumulatedStatus, pFrames);
	    // if the accumukated status is aborted, then we need to keep that status until we are done
	    // otherwise the status will be in the endpoint when we get to the callback case and will
	    // be reset afterwards
	    if (pEP->accumulatedStatus != kIOReturnAborted)
		pEP->accumulatedStatus = kIOReturnSuccess;
	    pTD->Deallocate(this);
	    pTD = GetTDfromDoneQueue(pEP);
	    if (pTD)
		pFrames = pTD->myFrames;
	}
	else
	{
	    pTD->Deallocate(this);
	    pTD = GetTDfromDoneQueue(pEP);
	}
    }
    
