apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_UIM.cpp
}



IOReturn 		
AppleUSBEHCI::UIMHubMaintenance(USBDeviceAddress highSpeedHub, UInt32 highSpeedPort, UInt32 command, UInt32 flags)
{
    AppleUSBEHCIHubInfoPtr	hiPtr;

    switch (command)
    {
	case kUSBHSHubCommandAddHub:
	    USBLog(7, "%s[%p]::UIMHubMaintenance - adding hub %d with flags %x", getName(), this, highSpeedHub, flags);
	    hiPtr = GetHubInfo(highSpeedHub, 0);
	    if (hiPtr)
	    {
		USBLog(7, "%s[%p]::UIMHubMaintenance - adding hub which already exists (%d)", getName(), this, highSpeedHub);
		hiPtr->flags = flags;
	    }
	    else
	    {
		hiPtr = NewHubInfo(highSpeedHub, 0);
		if (!hiPtr)
		    return kIOReturnNoMemory;
		USBLog(7, "%s[%p]::UIMHubMaintenance - done creating new hub (%p) for address (%d)", getName(), this, hiPtr, highSpeedHub);
		hiPtr->flags = flags;
					hiPtr->bandwidthAvailable = kUSBMaxIsocFrameReqCount;
	    }
	    break;
	    
	case kUSBHSHubCommandRemoveHub:
	    USBLog(7, "%s[%p]::UIMHubMaintenance - deleting hub %d", getName(), this, highSpeedHub);
	    DeleteHubInfo(highSpeedHub, 0xffff);	// remove all ports
	    break;

	default:
	    return kIOReturnBadArgument;
    }
    return kIOReturnSuccess;
}
#define	kEHCIUIMScratchFirstActiveFrame	0

void 
AppleUSBEHCI::ReturnOneTransaction(
            EHCIGeneralTransferDescriptor 	*transaction,
            AppleEHCIQueueHead   		*pED,
            AppleEHCIQueueHead   		*pEDBack,
	    IOReturn				err)
{
    // make sure it is halted, since we should leave it linked
    HaltAsyncEndpoint(pED, pEDBack);

    // USBLog(6, "ReturnOneTransaction Enter with transaction %p",transaction);

    while(transaction!= NULL)
    {
	if(transaction->lastTDofTransaction)
	{
	    transaction = transaction->pLogicalNext;
	    break;
	}
	transaction = transaction->pLogicalNext;
	// USBLog(7, "ReturnOneTransaction next transaction %p",transaction);
    }
    // USBLog(6, "ReturnOneTransaction going with transaction %p",transaction);
    if(transaction == NULL)
    {
	// This works, sort of, NULL for an end transction means remove them all.
	// But there will be no callback
	USBLog(1, "%s[%p]::ReturnOneTransaction - returning all TDs on the queue", getName(), this);
    }
    else
    {
    
    }
    returnTransactions(pED, transaction);
}

UInt32 AppleUSBEHCI::findBufferRemaining(AppleEHCIQueueHead *pED)
{
UInt32 flags, bufferSizeRemaining;

	flags = USBToHostLong(pED->GetSharedLogical()->qTDFlags);

	bufferSizeRemaining = (flags & kEHCITDFlags_Bytes) >> kEHCITDFlags_BytesPhase;

	return(bufferSizeRemaining);
}

void
AppleUSBEHCI::CheckEDListForTimeouts(AppleEHCIQueueHead *head)
{
    AppleEHCIQueueHead			*pED = head;
    AppleEHCIQueueHead			*pEDBack = NULL, *pEDBack1 = NULL;
    IOPhysicalAddress			pTDPhys;
    EHCIGeneralTransferDescriptor 	*pTD;
	
    UInt32 				noDataTimeout;
    UInt32				completionTimeout;
    UInt32				rem;
    UInt32				curFrame = GetFrameNumber32();

    for (; pED != 0; pED = (AppleEHCIQueueHead *)pED->_logicalNext)
    {
	USBLog(7, "%s[%p]::CheckEDListForTimeouts - checking ED [%p]", getName(), this, pED);
	pED->print(7);
	// Need to keep a note of the previous ED for back links. Usually I'd
	// put a pEDBack = pED at the end of the loop, but there are lots of 
	// continues in this loop so it was getting skipped (and unlinking the
	// entire async schedule). These lines get the ED from the previous 
	// interation in pEDBack.
	pEDBack = pEDBack1;
	pEDBack1 = pED;


	// OHCI gets phys pointer and logicals that, that seems a little complicated, so
	// I'll get the logical pointer and compare it to the phys. If they're different,
	// this transaction has only just got to the head and the previous one(s) haven't
	// been scavenged yet. Assume its not a good candidate for a timeout.
	
	// get the top TD
	pTDPhys = USBToHostLong(pED->GetSharedLogical()->CurrqTDPtr) & kEHCIEDTDPtrMask;
	pTD = pED->qTD;
	if (!pTD)
	{
	    USBLog(6, "%s[%p]::CheckEDListForTimeouts - no TD", getName(), this);
	    continue;
	}

	if (!pTD->command)
	{
	    USBLog(7, "%s[%p]::CheckEDListForTimeouts - found a TD without a command - moving on", getName(), this);
	    continue;
	}
	
	if (pTD == pED->TailTD)
	{
	    USBLog(1, "%s[%p]::CheckEDListForTimeouts - ED (%p) - TD is TAIL but there is a command - pTD (%p)", getName(), this, pED, pTD);
	    pED->print(5);
	}
	
	if(pTDPhys != pTD->pPhysical)
	{
	    USBLog(5, "%s[%p]::CheckEDListForTimeouts - pED (%p) - mismatched logical and physical - TD (%p) will be scavenged later", getName(), this, pED, pTD);
	    pED->print(5);
	    continue;
	}

	noDataTimeout = pTD->command->GetNoDataTimeout();
	completionTimeout = pTD->command->GetCompletionTimeout();
	
	if (completionTimeout)
	{
	    UInt32	firstActiveFrame = pTD->command->GetUIMScratch(kEHCIUIMScratchFirstActiveFrame);
	    if (!firstActiveFrame)
	    {
		pTD->command->SetUIMScratch(kEHCIUIMScratchFirstActiveFrame, curFrame);
		continue;
	    }
	    if ((curFrame - firstActiveFrame) >= completionTimeout)
	    {
		USBLog(2, "%s[%p]::CheckEDListForTimeout - Found a TD [%p] on QH [%p] past the completion deadline, timing out! (%x - %x)", getName(), this, pTD, pED, curFrame, firstActiveFrame);
		pED->print(2);
		ReturnOneTransaction(pTD, pED, pEDBack, kIOUSBTransactionTimeout);
		continue;
	    }
	}
	
	if (!noDataTimeout)
	    continue;

	if (!pTD->lastFrame || (pTD->lastFrame > curFrame))
	{
	    // this pTD is not a candidate yet, remember the frame number and go on
	    pTD->lastFrame = curFrame;
	    pTD->lastRemaining = findBufferRemaining(pED /*pTD get value from overlay area*/);
	    continue;
	}
	rem = findBufferRemaining(pED /*pTD get value from overlay area*/);
		
	if (pTD->lastRemaining != rem)
	{
	    // there has been some activity on this TD. update and move on
	    pTD->lastRemaining = rem;
	    continue;
	}
	if ((curFrame - pTD->lastFrame) >= noDataTimeout)
	{
	    USBLog(2, "%s[%p]CheckEDListForTimeout:  Found a transaction which hasn't moved in 5 seconds, timing out! (%x - %x)", pTD, curFrame, pTD->lastFrame);
		//printED(pED);
		//printTD(pTD);
		//printAsyncQueue();
	    ReturnOneTransaction(pTD, pED, pEDBack, kIOUSBTransactionTimeout);
		//printED(pED);
		//printTD(pTD);
		//printAsyncQueue();

	    continue;
	}
    }
}


//=============================================================================================
//
//  UIMCheckForTimeouts
//
//  This routine is called every kUSBWatchdogTimeoutMS by the controller.  It is useful for
//  periodic checks in the UIM
//
//=============================================================================================
//
void
AppleUSBEHCI::UIMCheckForTimeouts(void)
{
    AbsoluteTime	currentTime;
    AbsoluteTime	lastRootHubChangeTime;
    UInt64		elapsedTime = 0;
    bool		allPortsDisconnected = false;

    // If we are not active anymore or if we're in ehciBusStateOff, then don't check for timeouts 
    //
    if ( isInactive() || (_onCardBus && _pcCardEjected) || !_ehciAvailable || (_ehciBusState != kEHCIBusStateRunning))
        return;

    // Check to see if our control or bulk lists have a TD that has timed out
    //
    CheckEDListForTimeouts(_AsyncHead);

    // See if it's time to check for Root Hub inactivity
    //
    if ( !_idleSuspend )
    {
        // Check to see if it's been kEHCICheckForRootHubConnectionsPeriod seconds
        // since we last checked this port
        //
        clock_get_uptime( &currentTime );
        SUB_ABSOLUTETIME(&currentTime, &_lastCheckedTime );
        absolutetime_to_nanoseconds(currentTime, &elapsedTime);
        elapsedTime /= 1000000000;				// Convert to seconds from nanoseconds
        
        if ( elapsedTime >= kEHCICheckForRootHubConnectionsPeriod )
        {
            USBLog(6,"%s[%p] Time to check for root hub inactivity on bus %d", getName(), this, _busNumber);
            clock_get_uptime( &_lastCheckedTime );
            
            // Check to see if the root hub has been inactive for kEHCICheckForRootHubInactivityPeriod seconds
            //
            allPortsDisconnected = RootHubAreAllPortsDisconnected();

            if ( allPortsDisconnected )
            {                
                // Find the last time we had a change in the root hub.  If it's been 30 secs or
                // more, then we are ready to suspend the ports
                //
                lastRootHubChangeTime = LastRootHubPortStatusChanged( false );
    
